ml.org
#+TITLE: Notes on Coursera, Machine Learning, 2019
#+AUTHOR: By Me
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: H:10

* Week 1 Introduction
** Introduction

Machine Learning: Field of study that gives computers the ability to learn without being explicitly programmed. (Arthur Samuel, 59)

Machine Learning: Well-posed learning problem: A computer program is said to learn from experience E with respect to some task T and some performance measure P, if its performance on T, as measured by P, improves with experience E. (Tom Mitchell, 1998)

Example: playing checkers.

E = the experience of playing many games of checkers

T = the task of playing checkers.

P = the probability that the program will win the next game.

In general, any machine learning problem can be assigned to one of two broad classifications:

Supervised learning and Unsupervised learning.

** Supervised Learning, e.g. Linear Regression. 

Regression = predict continuous valued output (e.g. price). 
Classification = discrete valued output (e.g. 0 or 1), maybe with probability

Support Vector Machines are able to deal with an infinite amount of features by using a neat mathematical trick.

** Unsupervised Learning

Usually Clustering algorithm. E.g. in computing clusters (in data centers), social network analysis, market segmentation, astronomical data analysis. 

Non-clustering: Cocktail party problem: Different audio sources, separate them. Finding structure in a chaotic environment. 

** Model Representatiomn

m - number of training examples
x - input variable
y - output/target variable
(x,y) - one training example
(x^(i), y^(i)) - i^th training example

Training Set
         |
Learning Algorithm
         |
Size  -> h -> Estimated price
of house
x   hypothesis  estimated y
h maps from x to y

h_\theta (x) = \theta_0 + \theta_1 x (linear function)

Linear regression with one variable (x)
= Univariate linear regression

** Cost Function

Come up with values for \theta_0, \theta_1, that fit the data well i.e. is close to the training examples.

Minimize squared error: Find values of theta s.t. the average error is minimal. Cost function = Objective function

J(\theta) - function of theta
h(x) - function of x

** Gradient Descent

General algorithm to find the minimum of a function. Not guaranteed to find global optimum in the general case.

The direction of each step is given by the partial derivatives of J(\theta). How exactly does one determine the direction of of steepest descent? For each parameter, you only have two options to choose from (left, right, or increase or decrease theta). If the derivative is positive, you want to move to the left, i.e. decrease theta. If the derivative is negative, you want to move to the right, i.e. increase theta. This is achieved by setting 

\theta_j := \theta_j - \alpha * (\partial / (\partial \theta_1) J(\theta_1)

As we approach a local minimum, gradient descent will automatically take smaller steps. No need to decrease the learning rate over time! 

For Linear Regression, the cost function is always a bowl-shaped function, i.e. convex function and only has one (the global) optimum.

*Batch Gradient Descent*: Each step of gradient descent uses all of the training examples

Normal Equation can solve the problem analytically; but gradient descent apparently scales better.

