ml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-26 Mo 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on Coursera, Machine Learning, 2019</title>
<meta name="author" content="By Me" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Notes on Coursera, Machine Learning, 2019</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org61f8c53">1. Week 1 Introduction</a>
<ul>
<li><a href="#org9a06150">1.1. Introduction</a></li>
<li><a href="#org0fcb4ba">1.2. Supervised Learning, e.g. Linear Regression.</a></li>
<li><a href="#orga885569">1.3. Unsupervised Learning</a></li>
<li><a href="#org843251c">1.4. Model Representatiomn</a></li>
<li><a href="#orgdd61311">1.5. Cost Function</a></li>
<li><a href="#org4277c32">1.6. Gradient Descent</a></li>
<li><a href="#org12ba14a">1.7. Linear Algebra Review</a></li>
</ul>
</li>
<li><a href="#org693c9e3">2. Week 2 Linear Regression with Multiple Variables</a>
<ul>
<li><a href="#orgfc44b9d">2.1. Multivariate Linear Regression</a></li>
<li><a href="#orga5daccc">2.2. Feature Scaling - Data Scientists don&rsquo;t believe this one simple trick!</a></li>
<li><a href="#orga26f77d">2.3. Learning rate</a></li>
<li><a href="#org7baaa47">2.4. Features and Polynomial Regression</a></li>
<li><a href="#org9722813">2.5. Normal Equation</a>
<ul>
<li><a href="#org0ea890e">2.5.1. Noninvertibility</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0d5c885">3. Week 3 Logistic Regression</a>
<ul>
<li><a href="#org4004bee">3.1. Introduction</a></li>
<li><a href="#org85b9a17">3.2. Cost Function for Logistic Regression</a></li>
<li><a href="#org181e570">3.3. Advanced optimization</a></li>
<li><a href="#org859786b">3.4. Multiclass classification</a></li>
<li><a href="#orgc3e3114">3.5. Overfitting</a></li>
<li><a href="#orgafd86eb">3.6. Regularization: Cost Function</a></li>
</ul>
</li>
<li><a href="#orgfcac0c7">4. Week 4 Neural Networks: Representation</a>
<ul>
<li><a href="#orgadab4e0">4.1. Non-linear Classification</a></li>
<li><a href="#orge2ee7f5">4.2. Neurons and the Brain</a></li>
<li><a href="#orgff59d17">4.3. Model Representation</a></li>
<li><a href="#org99a2adf">4.4. Example Calculation</a></li>
</ul>
</li>
<li><a href="#org8c7c384">5. Week 5 Neural Networks: Learning</a>
<ul>
<li><a href="#org6fa7ebf">5.1. Neural networks cost function</a></li>
<li><a href="#org802410a">5.2. Backpropagation algorithm.</a></li>
<li><a href="#org032848d">5.3. Gradient Checking</a></li>
<li><a href="#org6533c68">5.4. Random initialization</a></li>
<li><a href="#orgc4370b1">5.5. Putting it all together</a></li>
</ul>
</li>
<li><a href="#org8ee5799">6. Week 6 Advice for Applying Machine Learning</a>
<ul>
<li><a href="#org5aa25d0">6.1. Evaluating a Hypothesis</a></li>
<li><a href="#orga80861c">6.2. Model Selection and Train/Validation/Test Sets</a></li>
<li><a href="#org26ea2db">6.3. Diagnosing Bias vs. Variance</a></li>
<li><a href="#org0ff273a">6.4. Regularization and Bias/Variance</a></li>
<li><a href="#org9027a80">6.5. Learning Curves</a></li>
<li><a href="#orgbb98f8d">6.6. Deciding what to do next</a></li>
<li><a href="#org9839ea7">6.7. Prioritizing what to work on</a></li>
<li><a href="#orgf0231f7">6.8. Error Analysis</a></li>
<li><a href="#org7657842">6.9. Error Metrics for Skewed classes</a></li>
<li><a href="#org17575ec">6.10. Trade off Precision and Recall</a></li>
<li><a href="#org2280838">6.11. Data for Machine Learning</a></li>
</ul>
</li>
<li><a href="#org0506ec4">7. Week 7 Support Vector Machines</a>
<ul>
<li><a href="#org4e1fc4e">7.1. Optimization Objective</a></li>
<li><a href="#orga07cacf">7.2. Large Margin Classifier Intuition</a></li>
<li><a href="#org7e3ba59">7.3. Mathematics Behind Large Margin Classification</a></li>
<li><a href="#orgeacb897">7.4. Kernels</a></li>
<li><a href="#org1d1ef23">7.5. Using an SVM</a></li>
</ul>
</li>
<li><a href="#org6e999e3">8. Week 8 Unsupervised Learning</a>
<ul>
<li><a href="#orgca926bf">8.1. K-means Clustering</a></li>
<li><a href="#orga6022f6">8.2. Optimization Objective</a></li>
<li><a href="#orgb606130">8.3. Random Initialization and Avoiding Local Optima.</a></li>
<li><a href="#org3802a63">8.4. Dimensionality Reduction</a></li>
<li><a href="#orgbecde3a">8.5. Principal Component Analysis (PCA)</a></li>
<li><a href="#org7931efc">8.6. PCA Algorithm</a></li>
<li><a href="#org27a1d49">8.7. Reconstruction</a></li>
<li><a href="#orga005873">8.8. Choosing the number of principal components</a></li>
<li><a href="#orgb7bb48b">8.9. Advise on how to apply</a></li>
</ul>
</li>
<li><a href="#org9edcbaf">9. Week 9 Anomaly Detection</a>
<ul>
<li><a href="#orgd891543">9.1. Problem Motivation</a></li>
<li><a href="#org1d4b48b">9.2. Gaussian Distribution</a></li>
<li><a href="#orgf9443ef">9.3. Algorithm</a></li>
<li><a href="#org3a827e0">9.4. Developing and Evaluating an Anomaly Detection System</a></li>
<li><a href="#org19c49be">9.5. Anomaly Detection vs Supervised Learning</a></li>
<li><a href="#org7d47f7d">9.6. Choosing Features</a></li>
<li><a href="#org60ddda2">9.7. Multivariate Gaussian Distribution</a></li>
<li><a href="#orgff885e8">9.8. Anomaly Detection using the Multivariate Gaussian Distribution</a></li>
<li><a href="#org37c95d6">9.9. Recommender Systems: Problem Formulation</a></li>
<li><a href="#org242ac63">9.10. Content Based Recommendations</a></li>
<li><a href="#org7fa42f4">9.11. Collaborative Filtering</a></li>
<li><a href="#org49b0108">9.12. Collaborative Filter Algorithm</a></li>
<li><a href="#org60f067d">9.13. Vectorization: Low Rank Matrix Factorization</a></li>
<li><a href="#org4ca404a">9.14. Mean Normalization</a></li>
</ul>
</li>
<li><a href="#orgcc4fc46">10. Week 10 large Scale Machine Learning</a>
<ul>
<li><a href="#org8019305">10.1. Learning with Large Datasets</a></li>
<li><a href="#org6ac1b42">10.2. Stochastic Gradient Descent</a></li>
<li><a href="#org90fdd5c">10.3. Mini-Batch Gradient Descent</a></li>
<li><a href="#org307369a">10.4. Stochastic Gradient Descent Convergence</a></li>
<li><a href="#orgb4ceda4">10.5. Online Learning</a></li>
<li><a href="#org63afb79">10.6. Map Reduce and Parallelism</a></li>
</ul>
</li>
<li><a href="#orgd530527">11. Week 11 Application Example: Photo OCR</a>
<ul>
<li><a href="#orgf4ce9ac">11.1. Problem Description and Pipeline</a></li>
<li><a href="#orgd22c0dd">11.2. Sliding Windows</a></li>
<li><a href="#org5568bb3">11.3. Gettings Lots of Data and Artificial Data</a></li>
<li><a href="#orgb19583a">11.4. Ceiling Analysis: What part of the Pipeline to work on next?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org61f8c53" class="outline-2">
<h2 id="org61f8c53"><span class="section-number-2">1.</span> Week 1 Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9a06150" class="outline-3">
<h3 id="org9a06150"><span class="section-number-3">1.1.</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Machine Learning: Field of study that gives computers the ability to learn without being explicitly programmed. (Arthur Samuel, 59)
</p>

<p>
Machine Learning: Well-posed learning problem: A computer program is said to learn from experience E with respect to some task T and some performance measure P, if its performance on T, as measured by P, improves with experience E. (Tom Mitchell, 1998)
</p>

<p>
Example: playing checkers.
</p>

<p>
E = the experience of playing many games of checkers
</p>

<p>
T = the task of playing checkers.
</p>

<p>
P = the probability that the program will win the next game.
</p>

<p>
In general, any machine learning problem can be assigned to one of two broad classifications:
</p>

<p>
Supervised learning and Unsupervised learning.
</p>
</div>
</div>

<div id="outline-container-org0fcb4ba" class="outline-3">
<h3 id="org0fcb4ba"><span class="section-number-3">1.2.</span> Supervised Learning, e.g. Linear Regression.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Regression = predict continuous valued output (e.g. price). 
Classification = discrete valued output (e.g. 0 or 1), maybe with probability
</p>

<p>
Support Vector Machines are able to deal with an infinite amount of features by using a neat mathematical trick.
</p>
</div>
</div>

<div id="outline-container-orga885569" class="outline-3">
<h3 id="orga885569"><span class="section-number-3">1.3.</span> Unsupervised Learning</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Usually Clustering algorithm. E.g. in computing clusters (in data centers), social network analysis, market segmentation, astronomical data analysis. 
</p>

<p>
Non-clustering: Cocktail party problem: Different audio sources, separate them. Finding structure in a chaotic environment. 
</p>
</div>
</div>

<div id="outline-container-org843251c" class="outline-3">
<h3 id="org843251c"><span class="section-number-3">1.4.</span> Model Representatiomn</h3>
<div class="outline-text-3" id="text-1-4">
<p>
m - number of training examples
x - input variable
y - output/target variable
(x,y) - one training example
(x<sup>(i)</sup>, y<sup>(i)</sup>) - i<sup>th</sup> training example
</p>

<p>
Training Set
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
Learning Algorithm
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
Size  -&gt; h -&gt; Estimated price
of house
x   hypothesis  estimated y
h maps from x to y
</p>

<p>
h<sub>&theta;</sub> (x) = &theta;<sub>0</sub> + &theta;<sub>1</sub> x (linear function)
</p>

<p>
Linear regression with one variable (x)
= Univariate linear regression
</p>
</div>
</div>

<div id="outline-container-orgdd61311" class="outline-3">
<h3 id="orgdd61311"><span class="section-number-3">1.5.</span> Cost Function</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Come up with values for &theta;<sub>0</sub>, &theta;<sub>1</sub>, that fit the data well i.e. is close to the training examples.
</p>

<p>
Minimize squared error: Find values of theta s.t. the average error is minimal. Cost function = Objective function
</p>

<p>
J(&theta;) - function of theta
h(x) - function of x
</p>
</div>
</div>

<div id="outline-container-org4277c32" class="outline-3">
<h3 id="org4277c32"><span class="section-number-3">1.6.</span> Gradient Descent</h3>
<div class="outline-text-3" id="text-1-6">
<p>
General algorithm to find the minimum of a function. Not guaranteed to find global optimum in the general case.
</p>

<p>
The direction of each step is given by the partial derivatives of J(&theta;). How exactly does one determine the direction of of steepest descent? For each parameter, you only have two options to choose from (left, right, or increase or decrease theta). If the derivative is positive, you want to move to the left, i.e. decrease theta. If the derivative is negative, you want to move to the right, i.e. increase theta. This is achieved by setting 
</p>

<p>
&theta;<sub>j</sub> := &theta;<sub>j</sub> - &alpha; * (&part; / (&part; &theta;<sub>1</sub>) J(&theta;<sub>1</sub>)
</p>

<p>
As we approach a local minimum, gradient descent will automatically take smaller steps. No need to decrease the learning rate over time! 
</p>

<p>
For Linear Regression, the cost function is always a bowl-shaped function, i.e. convex function and only has one (the global) optimum.
</p>

<p>
<b>Batch Gradient Descent</b>: Each step of gradient descent uses all of the training examples
</p>

<p>
Normal Equation can solve the problem analytically; but gradient descent apparently scales better.
</p>
</div>
</div>
