ml.org
** Linear Algebra Review

In machine learning here, 1-indexed vectors are assumed. But sometimes switched to 0-indexed vectors.

Trick: Prediction = DataMatrix * ParametersVector

Matrix multiplication is not commutative
Matrix multiplication is associative.
Matrix multiplication with the identity matrix with the right dimensions is commutative

Square matrizes can have inverses:
A(A^-1) = (A^-1)A = I (identity matrix)
Usually matrizes not having an inverse is not really an issue. They are in some sense too close to zero.

* Week 2 Linear Regression with Multiple Variables
** Multivariate Linear Regression

n = number of features
x^(i) = input (features) of ith training example.
x_j^(i) = value of feature j in ith training example. 

$h_\theta(x) = \theta_0x_0 + \theta_1x_1 + \theta_2x_2 + ... + \theta_n x_n$

Define x_0^(i) = 1 for all i

\theta is an n+1 dimensional vector

h_\theta(x) = \theta^T x

** Feature Scaling - Data Scientists don't believe this one simple trick!

Make sure features are on a similar scale to improve convergence speed.

$-1 \leq x_i \leq 1$ approximately

Can use mean normalization. 

Replace $x_i$ with $x_i - \mu_i / s_i$, where $s_i$ is the range of that feature.  

** Learning rate

Tip: plot $J(\theta)$! Update $\alpha$ accordingly: If not decreasing on every step, try a lower $\alpha$! If decreasing too slowly, try higher $\alpha$. 

For sufficiently small $\alpha$, $J(\theta)$ provably decreases on every iteration.

** Features and Polynomial Regression 

Create new features by multiplying features.

Polynomial Regression is easily implementable: Add $x_j^2$ (and higher powers) as a new feature with additional $\theta_{j+1}$ - remember feature scaling! 
** Normal Equation

Method to solve for $\theta$ directly. Intuition: set derivative to zero and find minimum. Also works in the multivariate case! 

construct matrix of training data:
$$
X = \begin{bmatrix}
1 & 2014 & 5 & 1 & 45\\
1 & 1416 & 3 & 2 & 40\\
1 & 1534 & 3 & 2 & 30\\
1 & 852 & 2 & 1 & 36
\end{bmatrix}
$$ 
$$x^{(i)} = \begin{bmatrix} x_0^{i} \\ x_1^{i} \\ x_2^{i} \\ \vdots \\ x_n^{(i)} \end{bmatrix}$$
$$ X=\begin{bmatrix}(x^{(1)})^T \\ x^{(2)})^T \\ \vdots \\ x^{(2)})^T \end{bmatrix}$$

Normal Equation:
$$ \theta = (X^TX)^{-1}X^Ty $$

Note that we don't need feature scaling here.

When to use Gradient Descent or Normal Equation? NE goes slow when n gets large, at like 10000. GD: $O(Kn^2)$ NE: $O(n^3)$ 

*** Noninvertibility 

Sometimes, $X^TX$ is not invertible. This can happen if there are too many features or redundant i.e. linear dependent features.
Octave's pinv calculates the pseudoinverse which always exists (?)

* Week 3 Logistic Regression
** Introduction

Example: Spam/not Spam, Fraudulent transaction (yes, no), tumor: malignant/benign.
$y \in \{0,1\}$: 0: Negative Class, 1: Positive Class

Binary class problem set. Multiclass later.
You could treshold linear regression, but this does not work well.

$h_\theta(x) = g(\theta^Tx)$
$g(z) = \frac{1}{1 + e^-z}$

Such that $h_\theta(x) = 0.7$ means that x has a 70% chance of being positive class: $h_\theta(x) = p(y=1|x;\theta)$

Find a Decision boundary, e.g. $x_1 + x_2 \geq 3$

** Cost Function for Logistic Regression

Optimization objective. If we just use the one from Linear Regression, we get a non-convex cost function (many local optima). Instead use:

$$Cost(h_\theta(x),y) = \begin{cases} -log(h_\theta(x)) & \text{if } y = 1 \\ -log(1 - h_\theta(x)) & \text{if } y = 0  \end{cases}$$

or more succinctly,

$$J(\theta) = -1/m [\sum_{i=1}^m y^{(i)} \log h_\theta(x^{(i)} + (1-y^{(i)}) \log(1 - h_\theta(x^{(i)}))]$$
** Advanced optimization

Use more elaborate algorithms than gradient descent--like conjugate gradient, BFGS, L-BFGS--the section teaches you only how to use the octave API, nothing about those algorithms. Skip.

** Multiclass classification

E.g. Email tagging, medical diagrams, weather, etc.

$y = 1,2,3,4,...$

Strategy: One-vs-all classification. Augment training s.t. all 

** Overfitting

Overfitting: Algorithm has high variance - space of possible hypotheses is too large.
Too many features may cause the hypothesis fit the training set very well, but fail to generalize to new examples. Overfitting has the effect of generalizing not well.

Ways to address overfitting:
1. Reduce number of features
   - Manually select features
   - Model selection algorithm
2. Regularization
   - Reduce magnitudes/values of parameters
   - Works well with lots of features contributing little

** Regularization: Cost Function

Small values for parameters $\theta_0,\dots,\theta_n$ leads to a simpler hypothesis.

Add a regularization term add the end. 

$J(\theta) = \frac{1}{2m} [\sum^m_{i=1} (h_\theta(x^{(i)} - y^{(i)})^2 + \lambda \sum^n_{j=1} \theta_j^2]$ 

$\lambda$ is the regularization parameter and controls the trade-off between fitting and overfitting. Too large lambdas result in underfitting.

* Week 4 Neural Networks: Representation
** Non-linear Classification

Problem: number of quadratic features dramatically increases with linear non-linear approximation (i.e. including $x_1x_2$, $x_1^2$ etc. which are necessary to fit a complex dataset. Higher-order polynomials even more problematic! Practically impossible to do image recognition.

Guess what's much better!

** Neurons and the Brain

Computers only recently became fast enough to run large enough neural networks to be really useful. Inspired by the human brain. Hypothesis: the brain works with a single learning algorithm. evidence: auditory cortex that learns to see visually (in a controlled experiment on animals). Also: Learning to see with your tongue. 

