ml.html

<div id="outline-container-org12ba14a" class="outline-3">
<h3 id="org12ba14a"><span class="section-number-3">1.7.</span> Linear Algebra Review</h3>
<div class="outline-text-3" id="text-1-7">
<p>
In machine learning here, 1-indexed vectors are assumed. But sometimes switched to 0-indexed vectors.
</p>

<p>
Trick: Prediction = DataMatrix * ParametersVector
</p>

<p>
Matrix multiplication is not commutative
Matrix multiplication is associative.
Matrix multiplication with the identity matrix with the right dimensions is commutative
</p>

<p>
Square matrizes can have inverses:
A(A<sup>-1</sup>) = (A<sup>-1</sup>)A = I (identity matrix)
Usually matrizes not having an inverse is not really an issue. They are in some sense too close to zero.
</p>
</div>
</div>
</div>

<div id="outline-container-org693c9e3" class="outline-2">
<h2 id="org693c9e3"><span class="section-number-2">2.</span> Week 2 Linear Regression with Multiple Variables</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfc44b9d" class="outline-3">
<h3 id="orgfc44b9d"><span class="section-number-3">2.1.</span> Multivariate Linear Regression</h3>
<div class="outline-text-3" id="text-2-1">
<p>
n = number of features
x<sup>(i)</sup> = input (features) of ith training example.
x<sub>j</sub><sup>(i)</sup> = value of feature j in ith training example. 
</p>

<p>
\(h_\theta(x) = \theta_0x_0 + \theta_1x_1 + \theta_2x_2 + ... + \theta_n x_n\)
</p>

<p>
Define x<sub>0</sub><sup>(i)</sup> = 1 for all i
</p>

<p>
&theta; is an n+1 dimensional vector
</p>

<p>
h<sub>&theta;</sub>(x) = &theta;<sup>T</sup> x
</p>
</div>
</div>

<div id="outline-container-orga5daccc" class="outline-3">
<h3 id="orga5daccc"><span class="section-number-3">2.2.</span> Feature Scaling - Data Scientists don&rsquo;t believe this one simple trick!</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Make sure features are on a similar scale to improve convergence speed.
</p>

<p>
\(-1 \leq x_i \leq 1\) approximately
</p>

<p>
Can use mean normalization. 
</p>

<p>
Replace \(x_i\) with \(x_i - \mu_i / s_i\), where \(s_i\) is the range of that feature.  
</p>
</div>
</div>

<div id="outline-container-orga26f77d" class="outline-3">
<h3 id="orga26f77d"><span class="section-number-3">2.3.</span> Learning rate</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Tip: plot \(J(\theta)\)! Update \(\alpha\) accordingly: If not decreasing on every step, try a lower \(\alpha\)! If decreasing too slowly, try higher \(\alpha\). 
</p>

<p>
For sufficiently small \(\alpha\), \(J(\theta)\) provably decreases on every iteration.
</p>
</div>
</div>

<div id="outline-container-org7baaa47" class="outline-3">
<h3 id="org7baaa47"><span class="section-number-3">2.4.</span> Features and Polynomial Regression</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Create new features by multiplying features.
</p>

<p>
Polynomial Regression is easily implementable: Add \(x_j^2\) (and higher powers) as a new feature with additional \(\theta_{j+1}\) - remember feature scaling! 
</p>
</div>
</div>
<div id="outline-container-org9722813" class="outline-3">
<h3 id="org9722813"><span class="section-number-3">2.5.</span> Normal Equation</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Method to solve for \(\theta\) directly. Intuition: set derivative to zero and find minimum. Also works in the multivariate case! 
</p>

<p>
construct matrix of training data:
\[
X = \begin{bmatrix}
1 & 2014 & 5 & 1 & 45\\
1 & 1416 & 3 & 2 & 40\\
1 & 1534 & 3 & 2 & 30\\
1 & 852 & 2 & 1 & 36
\end{bmatrix}
\] 
\[x^{(i)} = \begin{bmatrix} x_0^{i} \\ x_1^{i} \\ x_2^{i} \\ \vdots \\ x_n^{(i)} \end{bmatrix}\]
\[ X=\begin{bmatrix}(x^{(1)})^T \\ x^{(2)})^T \\ \vdots \\ x^{(2)})^T \end{bmatrix}\]
</p>

<p>
Normal Equation:
\[ \theta = (X^TX)^{-1}X^Ty \]
</p>

<p>
Note that we don&rsquo;t need feature scaling here.
</p>

<p>
When to use Gradient Descent or Normal Equation? NE goes slow when n gets large, at like 10000. GD: \(O(Kn^2)\) NE: \(O(n^3)\) 
</p>
</div>

<div id="outline-container-org0ea890e" class="outline-4">
<h4 id="org0ea890e"><span class="section-number-4">2.5.1.</span> Noninvertibility</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Sometimes, \(X^TX\) is not invertible. This can happen if there are too many features or redundant i.e. linear dependent features.
Octave&rsquo;s pinv calculates the pseudoinverse which always exists (?)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d5c885" class="outline-2">
<h2 id="org0d5c885"><span class="section-number-2">3.</span> Week 3 Logistic Regression</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4004bee" class="outline-3">
<h3 id="org4004bee"><span class="section-number-3">3.1.</span> Introduction</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Example: Spam/not Spam, Fraudulent transaction (yes, no), tumor: malignant/benign.
\(y \in \{0,1\}\): 0: Negative Class, 1: Positive Class
</p>

<p>
Binary class problem set. Multiclass later.
You could treshold linear regression, but this does not work well.
</p>

<p>
\(h_\theta(x) = g(\theta^Tx)\)
\(g(z) = \frac{1}{1 + e^-z}\)
</p>

<p>
Such that \(h_\theta(x) = 0.7\) means that x has a 70% chance of being positive class: \(h_\theta(x) = p(y=1|x;\theta)\)
</p>

<p>
Find a Decision boundary, e.g. \(x_1 + x_2 \geq 3\)
</p>
</div>
</div>

<div id="outline-container-org85b9a17" class="outline-3">
<h3 id="org85b9a17"><span class="section-number-3">3.2.</span> Cost Function for Logistic Regression</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Optimization objective. If we just use the one from Linear Regression, we get a non-convex cost function (many local optima). Instead use:
</p>

<p>
\[Cost(h_\theta(x),y) = \begin{cases} -log(h_\theta(x)) & \text{if } y = 1 \\ -log(1 - h_\theta(x)) & \text{if } y = 0  \end{cases}\]
</p>

<p>
or more succinctly,
</p>

<p>
\[J(\theta) = -1/m [\sum_{i=1}^m y^{(i)} \log h_\theta(x^{(i)} + (1-y^{(i)}) \log(1 - h_\theta(x^{(i)}))]\]
</p>
</div>
</div>
<div id="outline-container-org181e570" class="outline-3">
<h3 id="org181e570"><span class="section-number-3">3.3.</span> Advanced optimization</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Use more elaborate algorithms than gradient descent&#x2013;like conjugate gradient, BFGS, L-BFGS&#x2013;the section teaches you only how to use the octave API, nothing about those algorithms. Skip.
</p>
</div>
</div>

<div id="outline-container-org859786b" class="outline-3">
<h3 id="org859786b"><span class="section-number-3">3.4.</span> Multiclass classification</h3>
<div class="outline-text-3" id="text-3-4">
<p>
E.g. Email tagging, medical diagrams, weather, etc.
</p>

<p>
$y = 1,2,3,4,&#x2026;$
</p>

<p>
Strategy: One-vs-all classification. Augment training s.t. all 
</p>
</div>
</div>

<div id="outline-container-orgc3e3114" class="outline-3">
<h3 id="orgc3e3114"><span class="section-number-3">3.5.</span> Overfitting</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Overfitting: Algorithm has high variance - space of possible hypotheses is too large.
Too many features may cause the hypothesis fit the training set very well, but fail to generalize to new examples. Overfitting has the effect of generalizing not well.
</p>

<p>
Ways to address overfitting:
</p>
<ol class="org-ol">
<li>Reduce number of features
<ul class="org-ul">
<li>Manually select features</li>
<li>Model selection algorithm</li>
</ul></li>
<li>Regularization
<ul class="org-ul">
<li>Reduce magnitudes/values of parameters</li>
<li>Works well with lots of features contributing little</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgafd86eb" class="outline-3">
<h3 id="orgafd86eb"><span class="section-number-3">3.6.</span> Regularization: Cost Function</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Small values for parameters \(\theta_0,\dots,\theta_n\) leads to a simpler hypothesis.
</p>

<p>
Add a regularization term add the end. 
</p>

<p>
\(J(\theta) = \frac{1}{2m} [\sum^m_{i=1} (h_\theta(x^{(i)} - y^{(i)})^2 + \lambda \sum^n_{j=1} \theta_j^2]\) 
</p>

<p>
\(\lambda\) is the regularization parameter and controls the trade-off between fitting and overfitting. Too large lambdas result in underfitting.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfcac0c7" class="outline-2">
<h2 id="orgfcac0c7"><span class="section-number-2">4.</span> Week 4 Neural Networks: Representation</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgadab4e0" class="outline-3">
<h3 id="orgadab4e0"><span class="section-number-3">4.1.</span> Non-linear Classification</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Problem: number of quadratic features dramatically increases with linear non-linear approximation (i.e. including \(x_1x_2\), \(x_1^2\) etc. which are necessary to fit a complex dataset. Higher-order polynomials even more problematic! Practically impossible to do image recognition.
</p>

<p>
Guess what&rsquo;s much better!
</p>
</div>
</div>

<div id="outline-container-orge2ee7f5" class="outline-3">
<h3 id="orge2ee7f5"><span class="section-number-3">4.2.</span> Neurons and the Brain</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Computers only recently became fast enough to run large enough neural networks to be really useful. Inspired by the human brain. Hypothesis: the brain works with a single learning algorithm. evidence: auditory cortex that learns to see visually (in a controlled experiment on animals). Also: Learning to see with your tongue. 
</p>
</div>
</div>
