ml.org
** Model Representation

Dendrites: 'input wires', Axon: 'output wire'. Neuron model: logistic unit with sigmoid (logistic) activation function $h_\theta(x) = 1/(1+exp(-\theta^Tx))$ with the parameters as weights!

$a_i^{(j)} = $ "activation" of unit i in layer j
$\Theta^{(j)}$ = matrix of weights controlling function mapping from layer j to layer j + 1 

e.g.
$a_1^{(2)} = g(\Theta_{10}^{(1)}x_0 + \Theta_{11}^{(1)}x_1 + \Theta_{12}^{(1)}x_2 + \Theta_{13}^{(1)}x_3)$

Dimensions of $\Theta^{j}$ are $s_{j+1} (s_j + 1)$. 

How can NNs help to compute a nonlinear hypothesis? 

Just the last layer of neural net with one output node is JUST computing logistic regression with the output of the previous layer as input features. The previous layers work similarly. This way, the network 'learns its own features'.
 
This is the input to a node:
$z^{(2)} = \Theta^{(1)}a^{(1)}$

** Example Calculation
* Week 5 Neural Networks: Learning
** Neural networks cost function

L = total no. of layers in network
$s_l$ = no. of units (w/o bias) in layer l

Binary classification: y=0 or 1 vs. Multi-class classification (K classes): $y \in R^K$ with K output units


$J(\Theta) = -\frac{1}{m} [\sum_{i=1}^m\sum_{k=1}^m y_k^{(i)}\log h_\theta(x^{i})_k + (1 - y_k^{(i)}\log(1 - h_\theta(x^{(i)})_k)] + \frac{\lambda}{2m} \sum_{l=1}^{L-1}\sum_{i=1}^{s_l}\sum_{j=1}{s_{l+1}}(\Theta_j^{(l)})^2$ 

** Backpropagation algorithm. 

"Backpropagation" is neural-network terminology for minimizing our cost function, just like what we were doing with gradient descent in logistic and linear regression. Our goal is to compute:

$\min_\Theta J(\Theta)$

That is, we want to minimize our cost function J using an optimal set of parameters in theta. In this section we'll look at the equations we use to compute the partial derivative of $J(\Theta)$:

$\frac{\partial}{\partial \Theta_{ij}^{(l)}} J(\Theta)$

$\delta_j^{(l)}$ = error of node j in layer l

It can be shown that, if you ignore the regularization term, 
$\frac{\partial}{\partial \Theta_{ij}^{(l)}} J(\Theta) = a_j^{(l)}\delta_i^{(l+1)}$.

** Gradient Checking

Helps make the implementation bug-free. Idea: numerically estimate gradient.

$\partial/\partial J(\theta) = \frac{J(\theta + \epsilon) - J(\theta-\epsilon)}{2\epsilon}$,

where $\epsilon$ is around $10^{-4}$. Of course, slightly more complicated with multiple epsilon.

Then check that it is somewhat the same as the gradient calculated with backprop.

** Random initialization

Zero initialization of the weights won't work: All of the hidden units would compute the same function. Useless! Initialize each $\Theta^{(l)}_{ij}$ to random value in  $[\epsilon, -\epsilon]$

** Putting it all together

Usually, the more hidden units per layer, the better. Later more on how to choose a good network architecture.
Number of hidden units per layer = usually more the better (must balance with cost of computation as it increases with more hidden units)
Defaults: 1 hidden layer. If you have more than 1 hidden layer, then it is recommended that you have the same number of units in every hidden layer.

Steps for training a neural net.

1) Randomly initialize weights
2) Implement forward propagation
3) Implement code to compute cost function 
4) Implement backprop to compute partial derivatives
5) Use gradient checking to see that the implementation works correctly.
6) Use gradient descent or advanced optimization with backprop to minimize the cost function.

Start with using a for loop for backprop!
In general, $J(\theta)$ is not convex. But in practice usually not a big problem.
* Week 6 Advice for Applying Machine Learning
** Evaluating a Hypothesis

How to see whether you're overfitting? One way: Split into training and test set. roughly 70%/30%. Calculate the error on the test set. 
For example with the 0/1 misclassification error.

** Model Selection and Train/Validation/Test Sets

Problems with fitting a meta-parameter, e.g. the degree of polynomial, to the test set: Chosen model probably won't generalize well to new data. Instead have:

Training set, ca 60%, Cross validation set, ca. 20%, and test set, ca 20%.
Calculate train set error, cv set error and test set error. Chose the hypotheses based on the cross validation error. Then the hypothesis can be tested normally against the test set and its performance reported.

** Diagnosing Bias vs. Variance

High Bias = underfitting, High Variance = overfitting, basically. If $J_cv$ is high and $J_train$ is high, then we may have a bias problem. If $J_train$ is very low, but $J_cv$ is high, then we have a high variance problem.

** Regularization and Bias/Variance

Regularization helps preventing overfitting. With very large $\lambda$, we get a high bias and underfit. With a too small $\lambda$, we get a high variance and overfit. 
How to choose $\lambda$? Use the same strategy as before, but vary $\lambda$ now instead of the dimension (say). $J_{cv}(\theta)$ is computed without the regularization term. 

** Learning Curves

Plot the training error and cv error over the size of artificially reduced training sets.
Training error will generally increase with the number of training examples. Cross validation error will generally decrease with the number of training examples. 

If the learning algorithm has high bias, then cv error and train error will converge almost. In this case, more training data doesn't help much.
If the learning algorithm has high variance, then training error and cv error will be far apart. Getting more training data is likely to help.

** Deciding what to do next

- Get more training examples fixes high variance
- Try a smaller sets of features fixes high variance
- Try getting additional features fixes high bias
- Try adding polynomial features fixes high bias
- Try decreasing lambda fixes high bias
- Try increasing lambda fixes high variance

Small neural networks
- prone to underfitting
- computationally cheap

Large neural networks
- prone to overfitting (use regularization to address)
- computationally more expensive

Usually, larger networks yield better performance.

