ml.html

<div id="outline-container-orgff59d17" class="outline-3">
<h3 id="orgff59d17"><span class="section-number-3">4.3.</span> Model Representation</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Dendrites: &rsquo;input wires&rsquo;, Axon: &rsquo;output wire&rsquo;. Neuron model: logistic unit with sigmoid (logistic) activation function \(h_\theta(x) = 1/(1+exp(-\theta^Tx))\) with the parameters as weights!
</p>

<p>
$a<sub>i</sub><sup>(j)</sup> = $ &ldquo;activation&rdquo; of unit i in layer j
\(\Theta^{(j)}\) = matrix of weights controlling function mapping from layer j to layer j + 1 
</p>

<p>
e.g.
\(a_1^{(2)} = g(\Theta_{10}^{(1)}x_0 + \Theta_{11}^{(1)}x_1 + \Theta_{12}^{(1)}x_2 + \Theta_{13}^{(1)}x_3)\)
</p>

<p>
Dimensions of \(\Theta^{j}\) are \(s_{j+1} (s_j + 1)\). 
</p>

<p>
How can NNs help to compute a nonlinear hypothesis? 
</p>

<p>
Just the last layer of neural net with one output node is JUST computing logistic regression with the output of the previous layer as input features. The previous layers work similarly. This way, the network &rsquo;learns its own features&rsquo;.
</p>

<p>
This is the input to a node:
\(z^{(2)} = \Theta^{(1)}a^{(1)}\)
</p>
</div>
</div>

<div id="outline-container-org99a2adf" class="outline-3">
<h3 id="org99a2adf"><span class="section-number-3">4.4.</span> Example Calculation</h3>
</div>
</div>
<div id="outline-container-org8c7c384" class="outline-2">
<h2 id="org8c7c384"><span class="section-number-2">5.</span> Week 5 Neural Networks: Learning</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6fa7ebf" class="outline-3">
<h3 id="org6fa7ebf"><span class="section-number-3">5.1.</span> Neural networks cost function</h3>
<div class="outline-text-3" id="text-5-1">
<p>
L = total no. of layers in network
\(s_l\) = no. of units (w/o bias) in layer l
</p>

<p>
Binary classification: y=0 or 1 vs. Multi-class classification (K classes): \(y \in R^K\) with K output units
</p>


<p>
\(J(\Theta) = -\frac{1}{m} [\sum_{i=1}^m\sum_{k=1}^m y_k^{(i)}\log h_\theta(x^{i})_k + (1 - y_k^{(i)}\log(1 - h_\theta(x^{(i)})_k)] + \frac{\lambda}{2m} \sum_{l=1}^{L-1}\sum_{i=1}^{s_l}\sum_{j=1}{s_{l+1}}(\Theta_j^{(l)})^2\) 
</p>
</div>
</div>

<div id="outline-container-org802410a" class="outline-3">
<h3 id="org802410a"><span class="section-number-3">5.2.</span> Backpropagation algorithm.</h3>
<div class="outline-text-3" id="text-5-2">
<p>
&ldquo;Backpropagation&rdquo; is neural-network terminology for minimizing our cost function, just like what we were doing with gradient descent in logistic and linear regression. Our goal is to compute:
</p>

<p>
\(\min_\Theta J(\Theta)\)
</p>

<p>
That is, we want to minimize our cost function J using an optimal set of parameters in theta. In this section we&rsquo;ll look at the equations we use to compute the partial derivative of \(J(\Theta)\):
</p>

<p>
\(\frac{\partial}{\partial \Theta_{ij}^{(l)}} J(\Theta)\)
</p>

<p>
\(\delta_j^{(l)}\) = error of node j in layer l
</p>

<p>
It can be shown that, if you ignore the regularization term, 
\(\frac{\partial}{\partial \Theta_{ij}^{(l)}} J(\Theta) = a_j^{(l)}\delta_i^{(l+1)}\).
</p>
</div>
</div>

<div id="outline-container-org032848d" class="outline-3">
<h3 id="org032848d"><span class="section-number-3">5.3.</span> Gradient Checking</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Helps make the implementation bug-free. Idea: numerically estimate gradient.
</p>

<p>
\(\partial/\partial J(\theta) = \frac{J(\theta + \epsilon) - J(\theta-\epsilon)}{2\epsilon}\),
</p>

<p>
where \(\epsilon\) is around \(10^{-4}\). Of course, slightly more complicated with multiple epsilon.
</p>

<p>
Then check that it is somewhat the same as the gradient calculated with backprop.
</p>
</div>
</div>

<div id="outline-container-org6533c68" class="outline-3">
<h3 id="org6533c68"><span class="section-number-3">5.4.</span> Random initialization</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Zero initialization of the weights won&rsquo;t work: All of the hidden units would compute the same function. Useless! Initialize each \(\Theta^{(l)}_{ij}\) to random value in  \([\epsilon, -\epsilon]\)
</p>
</div>
</div>

<div id="outline-container-orgc4370b1" class="outline-3">
<h3 id="orgc4370b1"><span class="section-number-3">5.5.</span> Putting it all together</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Usually, the more hidden units per layer, the better. Later more on how to choose a good network architecture.
Number of hidden units per layer = usually more the better (must balance with cost of computation as it increases with more hidden units)
Defaults: 1 hidden layer. If you have more than 1 hidden layer, then it is recommended that you have the same number of units in every hidden layer.
</p>

<p>
Steps for training a neural net.
</p>

<ol class="org-ol">
<li>Randomly initialize weights</li>
<li>Implement forward propagation</li>
<li>Implement code to compute cost function</li>
<li>Implement backprop to compute partial derivatives</li>
<li>Use gradient checking to see that the implementation works correctly.</li>
<li>Use gradient descent or advanced optimization with backprop to minimize the cost function.</li>
</ol>

<p>
Start with using a for loop for backprop!
In general, \(J(\theta)\) is not convex. But in practice usually not a big problem.
</p>
</div>
</div>
</div>
<div id="outline-container-org8ee5799" class="outline-2">
<h2 id="org8ee5799"><span class="section-number-2">6.</span> Week 6 Advice for Applying Machine Learning</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org5aa25d0" class="outline-3">
<h3 id="org5aa25d0"><span class="section-number-3">6.1.</span> Evaluating a Hypothesis</h3>
<div class="outline-text-3" id="text-6-1">
<p>
How to see whether you&rsquo;re overfitting? One way: Split into training and test set. roughly 70%/30%. Calculate the error on the test set. 
For example with the 0/1 misclassification error.
</p>
</div>
</div>

<div id="outline-container-orga80861c" class="outline-3">
<h3 id="orga80861c"><span class="section-number-3">6.2.</span> Model Selection and Train/Validation/Test Sets</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Problems with fitting a meta-parameter, e.g. the degree of polynomial, to the test set: Chosen model probably won&rsquo;t generalize well to new data. Instead have:
</p>

<p>
Training set, ca 60%, Cross validation set, ca. 20%, and test set, ca 20%.
Calculate train set error, cv set error and test set error. Chose the hypotheses based on the cross validation error. Then the hypothesis can be tested normally against the test set and its performance reported.
</p>
</div>
</div>

<div id="outline-container-org26ea2db" class="outline-3">
<h3 id="org26ea2db"><span class="section-number-3">6.3.</span> Diagnosing Bias vs. Variance</h3>
<div class="outline-text-3" id="text-6-3">
<p>
High Bias = underfitting, High Variance = overfitting, basically. If \(J_cv\) is high and \(J_train\) is high, then we may have a bias problem. If \(J_train\) is very low, but \(J_cv\) is high, then we have a high variance problem.
</p>
</div>
</div>

<div id="outline-container-org0ff273a" class="outline-3">
<h3 id="org0ff273a"><span class="section-number-3">6.4.</span> Regularization and Bias/Variance</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Regularization helps preventing overfitting. With very large \(\lambda\), we get a high bias and underfit. With a too small \(\lambda\), we get a high variance and overfit. 
How to choose \(\lambda\)? Use the same strategy as before, but vary \(\lambda\) now instead of the dimension (say). \(J_{cv}(\theta)\) is computed without the regularization term. 
</p>
</div>
</div>

<div id="outline-container-org9027a80" class="outline-3">
<h3 id="org9027a80"><span class="section-number-3">6.5.</span> Learning Curves</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Plot the training error and cv error over the size of artificially reduced training sets.
Training error will generally increase with the number of training examples. Cross validation error will generally decrease with the number of training examples. 
</p>

<p>
If the learning algorithm has high bias, then cv error and train error will converge almost. In this case, more training data doesn&rsquo;t help much.
If the learning algorithm has high variance, then training error and cv error will be far apart. Getting more training data is likely to help.
</p>
</div>
</div>

<div id="outline-container-orgbb98f8d" class="outline-3">
<h3 id="orgbb98f8d"><span class="section-number-3">6.6.</span> Deciding what to do next</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li>Get more training examples fixes high variance</li>
<li>Try a smaller sets of features fixes high variance</li>
<li>Try getting additional features fixes high bias</li>
<li>Try adding polynomial features fixes high bias</li>
<li>Try decreasing lambda fixes high bias</li>
<li>Try increasing lambda fixes high variance</li>
</ul>

<p>
Small neural networks
</p>
<ul class="org-ul">
<li>prone to underfitting</li>
<li>computationally cheap</li>
</ul>

<p>
Large neural networks
</p>
<ul class="org-ul">
<li>prone to overfitting (use regularization to address)</li>
<li>computationally more expensive</li>
</ul>

<p>
Usually, larger networks yield better performance.
</p>
</div>
</div>
