ml.org
** Prioritizing what to work on
What to work on? How not to waste time? Example: Spam classifier. 
- Don't decide via gut feeling, but instead list options & evaluate them carefully. e.g.
  - Decide on types of features. For spam: 10k - 50k most common words.
  - Collect lots of data (for example "honeypot" project but doesn't always work)
  - Develop sophisticated features (for example: using email header data in spam emails)
  - Develop algorithms to process your input in different ways (recognizing misspellings in spam).
** Error Analysis
- Start with simple algorithm to implement quickly, test it on cross-validation data.
- plot learning curves to decide if more features etc. are likely to help.
- Avoid premature optimization!
- Decide on feature augmentation (e.g. stemming) based on quick-and-dirty system comparing cross validation error.
** Error Metrics for Skewed classes
If you have a lot more data of one class than the other (in a logistic regression setting), then just predicting the dominant class gives you a reasonably good classification error. This is not good enough as a metric.
Precision and Recall help: 

| Predicted Class \ Actual Class | 1              | 0              |
|                              1 | True positive  | False Positive |
|                              0 | False Negative | True Negative  |

Precision = True Positive / (True Positive + False Positive)
Of all patients we predicted positive, what fraction actually has cancer?

Recall = True Positive / (True Positive + False Negatives)
Of all patients that actually have cancer, what fraction did we correctly detect as having cancer?

Usually, y=1 is the presence of the rare class 
** Trade off Precision and Recall
In a logistic regression setting:
- if the threshold is increased, we increase the precision, but get lower recall.
- if the threshold is lowered, precision is decreased, but recall gets higher.

Trade-off by varying the threshold. Many different forms that plot can look like.

F_1 score combines both precision and recall:
$F_1 = \frac{PR}{P+R}2$

** Data for Machine Learning
Sometimes, getting a lot of data is very effective.

"It's not the best algorithm that wins. It's who has the most data"

Under which circumstances is this actually the case?
Assume feature x has sufficient information to predict y accurately. Test: can a human expert confidently predict y from x?

Under this assumption: 
With a low bias algorithm (many parameters, logistic regression with many features, etc.) a large training set helps to get low variance, as a lot of data makes the model unlikely to overfit.

* Week 7 Support Vector Machines
** Optimization Objective
Support Vector Machines (SVM) can sometimes solve a problem better than other algorithms.
Start with logistic Regression. Modify it a bit to get SVM. Change the cost function slightly into a 2-part function with constant derivative.
Replace lambda with C.

$$ \min_\theta C \sum^m_{i=1} [ y^{(i)} cost_1(\theta^T x^{(i)}) + (1 - y^{(i)}) cost_0(\theta^T x^{(i)})] + \frac{1}{2} \sum^n_{j=0} \theta_j^2 $$

SVM will output $$h_\theta = 1$$ if $$\theta^T x \geq 0$$, and 0 otherwise.

** Large Margin Classifier Intuition

If y = 1, we wand $$\theta^T x \geq 1$$ and not just $$\theta^T x \geq 0$$.

What happens to the decision boundary? It has a larger margin to the training data. SVMs are more sophisticated than that, tho, and aren't as susceptible to outliers, depending on the value of regularization parameter C (= 1/lambda).

** Mathematics Behind Large Margin Classification

Inner product of two vectors: $$u^T v$$. $$||u||$$ is the euclidean length of u. p = length of projection of v onto u. $$u^T v = p * ||u||$$. p is signed, meaning it can be negative if the angle between u and v is greater than 90 degrees.

SVM Decision boundary: $$\min_\theta \sum \theta_j^2 = 1/2 (\theta_1^2 + \theta_2^2) = 1/2 (\sqrt{\theta_1^2 + \theta_2^2})^2 = 1/2 ||\theta||^2$$, for the simplification that n=2. The vector \theta is orthogonal to the decision boundary. Then if the decision boundary if close to training examples, the projection of that datum's vector onto theta is quite short, meaning that for the constraints to hold, the norm of theta has to increase. But we are minimizing the norm of theta! 

** Kernels

Kernels are a way to add non-linearity to SVMs. They define new features that employ a similarity metric for data points, e.g. a new feature $$f_1 = exp(- \frac{||x - l^{(i)}||^2}{2\sigma^2})$$, where l is a landmark somewhere in feature space. 

How are the landmarks computed? How many should we choose? Just use the training examples as landmarks!

Because of computational tricks, minimizing the SVM cost function is pretty fast.

Bias/Variance trade off: Large C: lower bias, higher variance (prone to overfitting). Small C: Higher bias, low variance. (Prone to underfitting). Large sigma: Higher bias, lower variance. Small sigma: Lower bias, higher variance.

** Using an SVM

Use software package for SVMs (gna). 
- Linear Kernels are standard linear classifiers. No Kernels used, really! When to use? if n (features) is large, and m (training examples) is small. Why use over standard logistic regression? I don't get it.
- Gaussian Kernels (the one discussed). If n small, m large.
- Polynomial kernels (performs worse usually than gaussians)
- Esoteric kernels: string kernels, chi-square kernels, historgram kernels, intersection kernels, ...

The octave package may expect you to provide the kernel function. Use feature scaling before! Kernel functions need to satisfy Mercer's theorem. 

Multiclass classification standardly through the library or with a one-vs-all method.

When to use Logistic Regression vs SVM?

If n is large relative to m, use logistic regression, or svm without a kernel.
If n is small, m is intermediate: Use SVM with Gaussian kernel
IF n is small, but m is large, create/add more features, then use logistic regression or SVM without a kernel.
Neural Nets likely to work in most of the settings, but slower to train. 
* Week 8 Unsupervised Learning

