ml.html

<div id="outline-container-org9839ea7" class="outline-3">
<h3 id="org9839ea7"><span class="section-number-3">6.7.</span> Prioritizing what to work on</h3>
<div class="outline-text-3" id="text-6-7">
<p>
What to work on? How not to waste time? Example: Spam classifier. 
</p>
<ul class="org-ul">
<li>Don&rsquo;t decide via gut feeling, but instead list options &amp; evaluate them carefully. e.g.
<ul class="org-ul">
<li>Decide on types of features. For spam: 10k - 50k most common words.</li>
<li>Collect lots of data (for example &ldquo;honeypot&rdquo; project but doesn&rsquo;t always work)</li>
<li>Develop sophisticated features (for example: using email header data in spam emails)</li>
<li>Develop algorithms to process your input in different ways (recognizing misspellings in spam).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf0231f7" class="outline-3">
<h3 id="orgf0231f7"><span class="section-number-3">6.8.</span> Error Analysis</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>Start with simple algorithm to implement quickly, test it on cross-validation data.</li>
<li>plot learning curves to decide if more features etc. are likely to help.</li>
<li>Avoid premature optimization!</li>
<li>Decide on feature augmentation (e.g. stemming) based on quick-and-dirty system comparing cross validation error.</li>
</ul>
</div>
</div>
<div id="outline-container-org7657842" class="outline-3">
<h3 id="org7657842"><span class="section-number-3">6.9.</span> Error Metrics for Skewed classes</h3>
<div class="outline-text-3" id="text-6-9">
<p>
If you have a lot more data of one class than the other (in a logistic regression setting), then just predicting the dominant class gives you a reasonably good classification error. This is not good enough as a metric.
Precision and Recall help: 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Predicted Class \ Actual Class</td>
<td class="org-left">1</td>
<td class="org-left">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">True positive</td>
<td class="org-left">False Positive</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-left">False Negative</td>
<td class="org-left">True Negative</td>
</tr>
</tbody>
</table>

<p>
Precision = True Positive / (True Positive + False Positive)
Of all patients we predicted positive, what fraction actually has cancer?
</p>

<p>
Recall = True Positive / (True Positive + False Negatives)
Of all patients that actually have cancer, what fraction did we correctly detect as having cancer?
</p>

<p>
Usually, y=1 is the presence of the rare class 
</p>
</div>
</div>
<div id="outline-container-org17575ec" class="outline-3">
<h3 id="org17575ec"><span class="section-number-3">6.10.</span> Trade off Precision and Recall</h3>
<div class="outline-text-3" id="text-6-10">
<p>
In a logistic regression setting:
</p>
<ul class="org-ul">
<li>if the threshold is increased, we increase the precision, but get lower recall.</li>
<li>if the threshold is lowered, precision is decreased, but recall gets higher.</li>
</ul>

<p>
Trade-off by varying the threshold. Many different forms that plot can look like.
</p>

<p>
F<sub>1</sub> score combines both precision and recall:
\(F_1 = \frac{PR}{P+R}2\)
</p>
</div>
</div>

<div id="outline-container-org2280838" class="outline-3">
<h3 id="org2280838"><span class="section-number-3">6.11.</span> Data for Machine Learning</h3>
<div class="outline-text-3" id="text-6-11">
<p>
Sometimes, getting a lot of data is very effective.
</p>

<p>
&ldquo;It&rsquo;s not the best algorithm that wins. It&rsquo;s who has the most data&rdquo;
</p>

<p>
Under which circumstances is this actually the case?
Assume feature x has sufficient information to predict y accurately. Test: can a human expert confidently predict y from x?
</p>

<p>
Under this assumption: 
With a low bias algorithm (many parameters, logistic regression with many features, etc.) a large training set helps to get low variance, as a lot of data makes the model unlikely to overfit.
</p>
</div>
</div>
</div>

<div id="outline-container-org0506ec4" class="outline-2">
<h2 id="org0506ec4"><span class="section-number-2">7.</span> Week 7 Support Vector Machines</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4e1fc4e" class="outline-3">
<h3 id="org4e1fc4e"><span class="section-number-3">7.1.</span> Optimization Objective</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Support Vector Machines (SVM) can sometimes solve a problem better than other algorithms.
Start with logistic Regression. Modify it a bit to get SVM. Change the cost function slightly into a 2-part function with constant derivative.
Replace lambda with C.
</p>

<p>
\[ \min_\theta C \sum^m_{i=1} [ y^{(i)} cost_1(\theta^T x^{(i)}) + (1 - y^{(i)}) cost_0(\theta^T x^{(i)})] + \frac{1}{2} \sum^n_{j=0} \theta_j^2 \]
</p>

<p>
SVM will output \[h_\theta = 1\] if \[\theta^T x \geq 0\], and 0 otherwise.
</p>
</div>
</div>

<div id="outline-container-orga07cacf" class="outline-3">
<h3 id="orga07cacf"><span class="section-number-3">7.2.</span> Large Margin Classifier Intuition</h3>
<div class="outline-text-3" id="text-7-2">
<p>
If y = 1, we wand \[\theta^T x \geq 1\] and not just \[\theta^T x \geq 0\].
</p>

<p>
What happens to the decision boundary? It has a larger margin to the training data. SVMs are more sophisticated than that, tho, and aren&rsquo;t as susceptible to outliers, depending on the value of regularization parameter C (= 1/lambda).
</p>
</div>
</div>

<div id="outline-container-org7e3ba59" class="outline-3">
<h3 id="org7e3ba59"><span class="section-number-3">7.3.</span> Mathematics Behind Large Margin Classification</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Inner product of two vectors: \[u^T v\]. \[||u||\] is the euclidean length of u. p = length of projection of v onto u. \[u^T v = p * ||u||\]. p is signed, meaning it can be negative if the angle between u and v is greater than 90 degrees.
</p>

<p>
SVM Decision boundary: \[\min_\theta \sum \theta_j^2 = 1/2 (\theta_1^2 + \theta_2^2) = 1/2 (\sqrt{\theta_1^2 + \theta_2^2})^2 = 1/2 ||\theta||^2\], for the simplification that n=2. The vector &theta; is orthogonal to the decision boundary. Then if the decision boundary if close to training examples, the projection of that datum&rsquo;s vector onto theta is quite short, meaning that for the constraints to hold, the norm of theta has to increase. But we are minimizing the norm of theta! 
</p>
</div>
</div>

<div id="outline-container-orgeacb897" class="outline-3">
<h3 id="orgeacb897"><span class="section-number-3">7.4.</span> Kernels</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Kernels are a way to add non-linearity to SVMs. They define new features that employ a similarity metric for data points, e.g. a new feature \[f_1 = exp(- \frac{||x - l^{(i)}||^2}{2\sigma^2})\], where l is a landmark somewhere in feature space. 
</p>

<p>
How are the landmarks computed? How many should we choose? Just use the training examples as landmarks!
</p>

<p>
Because of computational tricks, minimizing the SVM cost function is pretty fast.
</p>

<p>
Bias/Variance trade off: Large C: lower bias, higher variance (prone to overfitting). Small C: Higher bias, low variance. (Prone to underfitting). Large sigma: Higher bias, lower variance. Small sigma: Lower bias, higher variance.
</p>
</div>
</div>

<div id="outline-container-org1d1ef23" class="outline-3">
<h3 id="org1d1ef23"><span class="section-number-3">7.5.</span> Using an SVM</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Use software package for SVMs (gna). 
</p>
<ul class="org-ul">
<li>Linear Kernels are standard linear classifiers. No Kernels used, really! When to use? if n (features) is large, and m (training examples) is small. Why use over standard logistic regression? I don&rsquo;t get it.</li>
<li>Gaussian Kernels (the one discussed). If n small, m large.</li>
<li>Polynomial kernels (performs worse usually than gaussians)</li>
<li>Esoteric kernels: string kernels, chi-square kernels, historgram kernels, intersection kernels, &#x2026;</li>
</ul>

<p>
The octave package may expect you to provide the kernel function. Use feature scaling before! Kernel functions need to satisfy Mercer&rsquo;s theorem. 
</p>

<p>
Multiclass classification standardly through the library or with a one-vs-all method.
</p>

<p>
When to use Logistic Regression vs SVM?
</p>

<p>
If n is large relative to m, use logistic regression, or svm without a kernel.
If n is small, m is intermediate: Use SVM with Gaussian kernel
IF n is small, but m is large, create/add more features, then use logistic regression or SVM without a kernel.
Neural Nets likely to work in most of the settings, but slower to train. 
</p>
</div>
</div>
</div>
<div id="outline-container-org6e999e3" class="outline-2">
<h2 id="org6e999e3"><span class="section-number-2">8.</span> Week 8 Unsupervised Learning</h2>
<div class="outline-text-2" id="text-8">
</div>
