ml.org
** K-means Clustering
Non-labeled data. Cluster them! For example with the K-means algorithm. 
Iterative algorithm with 2 steps: 1) Cluster assignment, 2) Move Centroid.
After a while, the algorithm converges.

- K (number of clusters)
- Training set $$\{x^{(1)}, x^{(2)}, \dots, x^{(m)}\}$$

Randomly initialize K cluster centroids $$\mu_1, \mu_2, \dots, \mu_K \in \mathbb{R}^n$$
Repeat {
  # Cluster assignment step
  for i = 1 to m
    $$c^{(i)} := $$ index (from 1 to K) of cluster centroids closest $$x^{(i)}$$
  # Move centroid step
  for k = 1 to K
    $$\mu+k := $$ average of points assigned to cluster k.
}

This is also applicable to non-separated clusters. What does it help? E.g.clustering height/weight to find out tshirt sizes.
** Optimization Objective
What is the function that K-means optimizes? Minimizes J with respect to cluster assignments and clusters.

$$J(c^{(1)},\dots,c^{(2)},\mu_1,\dots,\mu_K) = 1/m \sum^m_{i=1} ||x^{(i)} - \mu_{c^{(i)}}||^2$$

** Random Initialization and Avoiding Local Optima.

Set K to less than number of training examples. Randomly pick K training examples. With unlucky initialization, K-means can end up in local optima. Solution? Do it 100 times over! Haha, great. Works good for low K = 2 - 10. 

How to choose the number of clusters? No fixed way. Most often choose manually.

** Dimensionality Reduction

Reduce data from 2D to 1D, for example. Works for highly correlated dimensions. Project data on a new feature. This also works for more dimensions, of course.

A motivation is to visualize the data better. There is no meaning assigned to the new dimensions, you have to recover it manually! PCA will allow us to find these new dimensions.

** Principal Component Analysis (PCA)

PCA tries to find a lower-dimensional surface, such that the projection error is minimized. Good practice to do feature scaling and mean normalization. 

Reduce from n-dimension to k-dimension: Find directions (vectors $$u^{(1)}, u^{(2)}, \dots, u^{(k)} \in \mathbb{R}^n$$ onto which to project the data so as to minimize the projection error.

** PCA Algorithm

First! Do data processing: feature scaling, mean normalization. The procedure to find the best values for the directions is quite easy, while the proof is rather hard.

- Compute Covariance matrix
$$\Sigma = 1/m \sum_{i=1}^n(x^{(i)})(x^{(i)})^T$$
- Compute eigenvectors of matrix $$\Sigma$$ by singular value decomposition. 
- Get resulting matrix $$U$$, take first k columns -> directions!
- Translate each data point x into a data point z in a space spanned by the new vectors.

** Reconstruction

The original data can be reconstructed. How? $$x_{approx} = U_{reduce} * z$$ will yield a value close to the original value. If the projection error was not large, we will get a good result!

** Choosing the number of principal components

PCA tries to minimize the average squared projection error. Choose k to be the smallest value to that 

$$ \frac{\sum_{i=1}^m || x^{(i)} - x_{approx}^{(i)}) ||^2}{\sum_{i=1}^m || x^{(i)} ||^2} \leq 0.01$$ such that "99% of variance is retained". Algorithm uses a trick with matrizes.

** Advise on how to apply
 
Most common use: Speed up supervised learning algorithm, so as a data preparation step. Useful when loads of features (> 10k). 

First extract unlabeled datasets. Then use PCA on x's. Then reapply labels. Only run PCA on the training set! The found mapping U_reduce can then also be applied to x_cv and x_test.

So PCA is used for...
- Compression
  - Reduce memory/disk usage
  - Speed up learning algorithm
  - Choose k by % of variance retained

- Visualization
  - k = 2 or 3

Misuse of PCA: Try to prevent overfitting. It might work OK, but it's not good. Instead use regularization. Use PCA only if without it won't work.



* Week 9 Anomaly Detection
** Problem Motivation
If p(x_test) < epsilon then flag anomaly. Otherwise ok. 
Application: Fraud detection. Features are user's activities. Identify unusual users. 
Application: Computers in a data center. Features e.g. memory use, CPU load, traffic etc.
** Gaussian Distribution
If $x \in \mathbb{R}$ is a distributed Gaussian with mean $\mu$ and variance $\sigma^2$, $x \sim N(\mu, \sigma^2)$, then: $p(x; \mu, \sigma^2) = \frac{1}{\sqrt{2\pi} \sigma} \exp{-\frac{(x - \mu)^2}{2\sigma^2}}$.

Parameter Estimation: Given a dataset, what are the parameters of my distribution? (If normally distributed).
$\mu = 1/m \sum_{i=1}^m x^{(i)}$, 
$\sigma = 1/m \sum_{(i=1)}^m(x^{(i)} - \mu)$.

** Algorithm

   $x_1 \sim N(\mu_1, sigma_1^2), \dots$
$p(x) = \prod_{j=1}^n p(x_j;\mu_j,\sigma_j^2)$

** Developing and Evaluating an Anomaly Detection System

How to do single-number evaluation? Assume labeled (as normal/anomalous) data. 10000 normal engines, 20 flawed engines. 

Training set: 6000 good engines, y = 0. Use these to estimate $\mu$ and $\sigma^2$.
Cross validation set: 2000 good engines, 10 anomalous
Test, 2000 good engines, 10 anomalous.

Fit model $p(x)$ on training set.
On cross validation / test example, predict
y = 1 if p(x) < epsilon (anomaly),
y = 0 if p(x) >= epsilon (normal).

Possible evaluation metrics:
  - true positive, false positive, false negative, true negative
  - Precision, Recall
  - F_1 score

Use cross validation set to choose parameter epsilon. 

** Anomaly Detection vs Supervised Learning

Why not just use Supervised Learning algorithm? 

Use Anomaly Detection:
- If you have a very small number of positive (anomalous) examples,
- Large number of negative (normal) examples.
- Many different types of anomalies
- future anomalies may look nothing like any of the anomalous examples we've seen so far.
- Fraud detection
- Manufacturing
- Machines in Data Center

Supervised Learning:
- Large number of positive and negative examples.
- Enough positive examples, future examples likely to be similar to ones in training set.
- Spam
- Weather 
- Cancer

