ml.html
<div id="outline-container-orgca926bf" class="outline-3">
<h3 id="orgca926bf"><span class="section-number-3">8.1.</span> K-means Clustering</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Non-labeled data. Cluster them! For example with the K-means algorithm. 
Iterative algorithm with 2 steps: 1) Cluster assignment, 2) Move Centroid.
After a while, the algorithm converges.
</p>

<ul class="org-ul">
<li>K (number of clusters)</li>
<li>Training set \[\{x^{(1)}, x^{(2)}, \dots, x^{(m)}\}\]</li>
</ul>

<p>
Randomly initialize K cluster centroids \[\mu_1, \mu_2, \dots, \mu_K \in \mathbb{R}^n\]
Repeat {
</p>

<p>
for i = 1 to m
  \[c^{(i)} := \] index (from 1 to K) of cluster centroids closest \[x^{(i)}\]
</p>

<p>
  for k = 1 to K
    \[\mu+k := \] average of points assigned to cluster k.
}
</p>

<p>
This is also applicable to non-separated clusters. What does it help? E.g.clustering height/weight to find out tshirt sizes.
</p>
</div>
</div>
<div id="outline-container-orga6022f6" class="outline-3">
<h3 id="orga6022f6"><span class="section-number-3">8.2.</span> Optimization Objective</h3>
<div class="outline-text-3" id="text-8-2">
<p>
What is the function that K-means optimizes? Minimizes J with respect to cluster assignments and clusters.
</p>

<p>
\[J(c^{(1)},\dots,c^{(2)},\mu_1,\dots,\mu_K) = 1/m \sum^m_{i=1} ||x^{(i)} - \mu_{c^{(i)}}||^2\]
</p>
</div>
</div>

<div id="outline-container-orgb606130" class="outline-3">
<h3 id="orgb606130"><span class="section-number-3">8.3.</span> Random Initialization and Avoiding Local Optima.</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Set K to less than number of training examples. Randomly pick K training examples. With unlucky initialization, K-means can end up in local optima. Solution? Do it 100 times over! Haha, great. Works good for low K = 2 - 10. 
</p>

<p>
How to choose the number of clusters? No fixed way. Most often choose manually.
</p>
</div>
</div>

<div id="outline-container-org3802a63" class="outline-3">
<h3 id="org3802a63"><span class="section-number-3">8.4.</span> Dimensionality Reduction</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Reduce data from 2D to 1D, for example. Works for highly correlated dimensions. Project data on a new feature. This also works for more dimensions, of course.
</p>

<p>
A motivation is to visualize the data better. There is no meaning assigned to the new dimensions, you have to recover it manually! PCA will allow us to find these new dimensions.
</p>
</div>
</div>

<div id="outline-container-orgbecde3a" class="outline-3">
<h3 id="orgbecde3a"><span class="section-number-3">8.5.</span> Principal Component Analysis (PCA)</h3>
<div class="outline-text-3" id="text-8-5">
<p>
PCA tries to find a lower-dimensional surface, such that the projection error is minimized. Good practice to do feature scaling and mean normalization. 
</p>

<p>
Reduce from n-dimension to k-dimension: Find directions (vectors \[u^{(1)}, u^{(2)}, \dots, u^{(k)} \in \mathbb{R}^n\] onto which to project the data so as to minimize the projection error.
</p>
</div>
</div>

<div id="outline-container-org7931efc" class="outline-3">
<h3 id="org7931efc"><span class="section-number-3">8.6.</span> PCA Algorithm</h3>
<div class="outline-text-3" id="text-8-6">
<p>
First! Do data processing: feature scaling, mean normalization. The procedure to find the best values for the directions is quite easy, while the proof is rather hard.
</p>

<ul class="org-ul">
<li>Compute Covariance matrix</li>
</ul>
<p>
\[\Sigma = 1/m \sum_{i=1}^n(x^{(i)})(x^{(i)})^T\]
</p>
<ul class="org-ul">
<li>Compute eigenvectors of matrix \[\Sigma\] by singular value decomposition.</li>
<li>Get resulting matrix \[U\], take first k columns -&gt; directions!</li>
<li>Translate each data point x into a data point z in a space spanned by the new vectors.</li>
</ul>
</div>
</div>

<div id="outline-container-org27a1d49" class="outline-3">
<h3 id="org27a1d49"><span class="section-number-3">8.7.</span> Reconstruction</h3>
<div class="outline-text-3" id="text-8-7">
<p>
The original data can be reconstructed. How? \[x_{approx} = U_{reduce} * z\] will yield a value close to the original value. If the projection error was not large, we will get a good result!
</p>
</div>
</div>

<div id="outline-container-orga005873" class="outline-3">
<h3 id="orga005873"><span class="section-number-3">8.8.</span> Choosing the number of principal components</h3>
<div class="outline-text-3" id="text-8-8">
<p>
PCA tries to minimize the average squared projection error. Choose k to be the smallest value to that 
</p>

<p>
\[ \frac{\sum_{i=1}^m || x^{(i)} - x_{approx}^{(i)}) ||^2}{\sum_{i=1}^m || x^{(i)} ||^2} \leq 0.01\] such that &ldquo;99% of variance is retained&rdquo;. Algorithm uses a trick with matrizes.
</p>
</div>
</div>

<div id="outline-container-orgb7bb48b" class="outline-3">
<h3 id="orgb7bb48b"><span class="section-number-3">8.9.</span> Advise on how to apply</h3>
<div class="outline-text-3" id="text-8-9">
<p>
Most common use: Speed up supervised learning algorithm, so as a data preparation step. Useful when loads of features (&gt; 10k). 
</p>

<p>
First extract unlabeled datasets. Then use PCA on x&rsquo;s. Then reapply labels. Only run PCA on the training set! The found mapping U<sub>reduce</sub> can then also be applied to x<sub>cv</sub> and x<sub>test</sub>.
</p>

<p>
So PCA is used for&#x2026;
</p>
<ul class="org-ul">
<li>Compression
<ul class="org-ul">
<li>Reduce memory/disk usage</li>
<li>Speed up learning algorithm</li>
<li>Choose k by % of variance retained</li>
</ul></li>

<li>Visualization
<ul class="org-ul">
<li>k = 2 or 3</li>
</ul></li>
</ul>

<p>
Misuse of PCA: Try to prevent overfitting. It might work OK, but it&rsquo;s not good. Instead use regularization. Use PCA only if without it won&rsquo;t work.
</p>
</div>
</div>
</div>



<div id="outline-container-org9edcbaf" class="outline-2">
<h2 id="org9edcbaf"><span class="section-number-2">9.</span> Week 9 Anomaly Detection</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgd891543" class="outline-3">
<h3 id="orgd891543"><span class="section-number-3">9.1.</span> Problem Motivation</h3>
<div class="outline-text-3" id="text-9-1">
<p>
If p(x<sub>test</sub>) &lt; epsilon then flag anomaly. Otherwise ok. 
Application: Fraud detection. Features are user&rsquo;s activities. Identify unusual users. 
Application: Computers in a data center. Features e.g. memory use, CPU load, traffic etc.
</p>
</div>
</div>
<div id="outline-container-org1d4b48b" class="outline-3">
<h3 id="org1d4b48b"><span class="section-number-3">9.2.</span> Gaussian Distribution</h3>
<div class="outline-text-3" id="text-9-2">
<p>
If \(x \in \mathbb{R}\) is a distributed Gaussian with mean \(\mu\) and variance \(\sigma^2\), \(x \sim N(\mu, \sigma^2)\), then: \(p(x; \mu, \sigma^2) = \frac{1}{\sqrt{2\pi} \sigma} \exp{-\frac{(x - \mu)^2}{2\sigma^2}}\).
</p>

<p>
Parameter Estimation: Given a dataset, what are the parameters of my distribution? (If normally distributed).
\(\mu = 1/m \sum_{i=1}^m x^{(i)}\), 
\(\sigma = 1/m \sum_{(i=1)}^m(x^{(i)} - \mu)\).
</p>
</div>
</div>

<div id="outline-container-orgf9443ef" class="outline-3">
<h3 id="orgf9443ef"><span class="section-number-3">9.3.</span> Algorithm</h3>
<div class="outline-text-3" id="text-9-3">
<p>
\(x_1 \sim N(\mu_1, sigma_1^2), \dots\)
\(p(x) = \prod_{j=1}^n p(x_j;\mu_j,\sigma_j^2)\)
</p>
</div>
</div>

<div id="outline-container-org3a827e0" class="outline-3">
<h3 id="org3a827e0"><span class="section-number-3">9.4.</span> Developing and Evaluating an Anomaly Detection System</h3>
<div class="outline-text-3" id="text-9-4">
<p>
How to do single-number evaluation? Assume labeled (as normal/anomalous) data. 10000 normal engines, 20 flawed engines. 
</p>

<p>
Training set: 6000 good engines, y = 0. Use these to estimate \(\mu\) and \(\sigma^2\).
Cross validation set: 2000 good engines, 10 anomalous
Test, 2000 good engines, 10 anomalous.
</p>

<p>
Fit model \(p(x)\) on training set.
On cross validation / test example, predict
y = 1 if p(x) &lt; epsilon (anomaly),
y = 0 if p(x) &gt;= epsilon (normal).
</p>

<p>
Possible evaluation metrics:
</p>
<ul class="org-ul">
<li>true positive, false positive, false negative, true negative</li>
<li>Precision, Recall</li>
<li>F<sub>1</sub> score</li>
</ul>

<p>
Use cross validation set to choose parameter epsilon. 
</p>
</div>
</div>

<div id="outline-container-org19c49be" class="outline-3">
<h3 id="org19c49be"><span class="section-number-3">9.5.</span> Anomaly Detection vs Supervised Learning</h3>
<div class="outline-text-3" id="text-9-5">
<p>
Why not just use Supervised Learning algorithm? 
</p>

<p>
Use Anomaly Detection:
</p>
<ul class="org-ul">
<li>If you have a very small number of positive (anomalous) examples,</li>
<li>Large number of negative (normal) examples.</li>
<li>Many different types of anomalies</li>
<li>future anomalies may look nothing like any of the anomalous examples we&rsquo;ve seen so far.</li>
<li>Fraud detection</li>
<li>Manufacturing</li>
<li>Machines in Data Center</li>
</ul>

<p>
Supervised Learning:
</p>
<ul class="org-ul">
<li>Large number of positive and negative examples.</li>
<li>Enough positive examples, future examples likely to be similar to ones in training set.</li>
<li>Spam</li>
<li>Weather</li>
<li>Cancer</li>
</ul>
</div>
</div>
