ml.org
** Choosing Features 

Features are modeled using normal distributions. What if data doesn't look Gaussian on the histogram? Do data transformation (why no beta distribution instead? Don't know.) For example, replace x with log(x) or sqrt(x) or similar. Weird flex but ok.

Which features to choose? Want: p(x) large for normal examples. p(x) small for anomalous examples. Problem: p(x) is similar for normal and anomalous examples.

Solution: GET INSPIRED by anomalous examples to create a new feature such that the data shows that the example is anomalous. For example. CPU Load divided by Network traffic. 

** Multivariate Gaussian Distribution

$x \in \mathbb{R}^n$. Model $p(x)$ all in one go. Parameters: $\mu in \mathbb{R}^n, \Sigma \in \mathbb{R}^{n\times \n}$ (covariance matrix). 

Example: 
$$ \Sigma = \begin{pmatrix} a_1 & b_1 \\b_2 & a_2\end{pmatrix} $$ 
These values change the form of the normal distribution. For example, if $a_1 < a_2$, the distribution is squeezed (in dimension $x_1), vice versa it is stretched. $b_1, b_2$ model the correlations between $x_1, x_2$. 

$$\mu = \begin{pmatrix} \mu_1 \\ \mu_2\end{pmatrix} $$ shift the center of the distribution.

$$p(x;\mu,\Sigma) = ((2\i)^{n/2}|\Sigma|^{1/2})^{-1} \exp(-1/2 (x-\mu)^T\Sigma^{-1}(x-\mu))$$

** Anomaly Detection using the Multivariate Gaussian Distribution

Fit model $p(x)$ by

$$\mu = 1/m \sum^m_{i=1} x^{(i)} $$
$$\Sigma = 1/m \sum^m_{i=1}(x^{(i)}-\mu)(x^{(i)}-\mu)^T $$

Calculate $$p(x)$$, flag anomaly if $p(x) < \epsilon$

You can prove that the original (non-multivariate) corresponds (up to identity!) to a special case of multivariate Gaussian distribution where the dist is axis-aligned, i.e. $b_1,b_2$ are 0, i.e. $\Sigma$ has 0 on off-diagonal entries. 

Original model is used somewhat more often. By adding features one can model dependencies between the features. Multivariate has this built in. But is computationally more expensive, doesn't scale well to large $n$. In addition, multivariate needs more examples than features (mathematical necessity since $\Sigma$ must be invertible).

** Recommender Systems: Problem Formulation

Sometimes you need new features, and learn them first. Predicting movie ratings. 
$n_u =$ number of users, $n_m$ = number of movies, $r(i,j) = 1$ if user $j$ has rated movie $i$, $y^{(i,j)} =$ rating given by use $j$ to movie $i$.

Our job: fill in missing values.

** Content Based Recommendations

Suppose you have two features per movie $\in [0,1]$, e.g. romance and action.
One possibility: For each user $j$, learn a parameter $\theta^{(j)} \in \mathbb{R}^3$. Predict user $j$ as rating movie $i$ with $(\theta^{(j)})^T x^{(i)}$ stars.

To learn $\theta^{(j)}$ is basically a linear regression problem. So minimize the squared error term with regularization. Do this e.g. by gradient descent.

This is basically just linear regression for all users on the features. Not extremely interesting. But what if you don't have features for the movies?

** Collaborative Filtering

CF can learn for itself, what features to use. How? Suppose we have a dataset without the values for features. Suppose users told us how much they liked action packed movies, romantic movies etc. 

$$\theta^{(1)} = \begin{bmatrix}0\\0\end{bmatrix},\ \theta^{(2)} = \begin{bmatrix}0\\3\end{bmatrix},\ \theta^{(3)} = \begin{bmatrix}0\\5\end{bmatrix}$$

Given $\theta^{(1)},\dots,\theta^{(n_u)}$, learn $x^{(i)}$ by error minimization. Learn all the features for all the movies at once. 

So now, what to estimate? Apparently by starting randomly and then iteratively estimating theta via x and x via theta. Need to figure out why that works exactly.

Collaborative because users 'collaborate' so everybody gets better recommendations.

** Collaborative Filter Algorithm

Minimize $x^{(i)},\dots,x^{(n_m)}$ and $\theta^{(i)},\dots,\theta^{(n_u)}$ simultaneously.

Do away with the convention of the intercept term, so $x \in \mathbb{R}^n$, since if there is need, the algorithm will learn it by itself.

1. Initialize parameters to small random values.
2. Minimize cost function using gradient descent (or similar). 
** Vectorization: Low Rank Matrix Factorization
Write all predicted ratings up in a matrix $Y$. Further, you have $X$ and $\Theta$, such that $Y = X\Theta^T$. This matrix is 'low rank' in linear algebra. No explanation as to what that is ("don't worry about it"). 

$$X = \begin{bmatrix} - & (x^{(1)})^T & - \\ & \vdots & \\ - & (x^{(n_m)} & - \end{bmatrix},\ \Theta = \begin{bmatrix} - & (\theta^{(1)})^T & - \\ & \vdots & \\ - & (\theta^{(n_u)} & - \end{bmatrix}$$

$$Y = \displaystyle \begin{bmatrix} (x^{(1)})^T(\theta^{(1)}) & \ldots & (x^{(1)})^T(\theta^{(n_u)})\\ \vdots & \ddots & \vdots \\ (x^{(n_m)})^T(\theta^{(1)}) & \ldots & (x^{(n_m)})^T(\theta^{(n_u)})\end{bmatrix}$$

For each product $i$, we learn a feature vector $x^{(i)} \in \mathbb{R}^2$. Not always are the features easily human-understandable.

How to find movies $j$ related to movie $i$ ? Find the 5 movies j with the smalles distance $||x^{(i)} - x^{(j)}||$.

** Mean Normalization

Can make the algorithm a little bit better. If a user hasn't rated anything yet, the algorithm will set all $\thetas$ to 0. But that isn't very useful right now. Change all the other values such that the average rating is 0. 

Then, predict for use $j$ on movie $i$:
$$\theta^{(j)}^T x^{(i)} + \mu_i$$


* Week 10 large Scale Machine Learning

** Learning with Large Datasets

"It's not who has the best algorithms that wins, it's who has the most data"

$m = 100,000,000$ not unrealistic. Then gradient descent can become prohibitively expensive. Maybe pick randomly some examples as a sanity check. If high variance ($J_{CV} >> J_{train}$), then it is prudent to use more data. Methods: Stochastic Gradient Descent, Map Reduce.

