ml.html

<div id="outline-container-org7d47f7d" class="outline-3">
<h3 id="org7d47f7d"><span class="section-number-3">9.6.</span> Choosing Features</h3>
<div class="outline-text-3" id="text-9-6">
<p>
Features are modeled using normal distributions. What if data doesn&rsquo;t look Gaussian on the histogram? Do data transformation (why no beta distribution instead? Don&rsquo;t know.) For example, replace x with log(x) or sqrt(x) or similar. Weird flex but ok.
</p>

<p>
Which features to choose? Want: p(x) large for normal examples. p(x) small for anomalous examples. Problem: p(x) is similar for normal and anomalous examples.
</p>

<p>
Solution: GET INSPIRED by anomalous examples to create a new feature such that the data shows that the example is anomalous. For example. CPU Load divided by Network traffic. 
</p>
</div>
</div>

<div id="outline-container-org60ddda2" class="outline-3">
<h3 id="org60ddda2"><span class="section-number-3">9.7.</span> Multivariate Gaussian Distribution</h3>
<div class="outline-text-3" id="text-9-7">
<p>
\(x \in \mathbb{R}^n\). Model \(p(x)\) all in one go. Parameters: \(\mu in \mathbb{R}^n, \Sigma \in \mathbb{R}^{n\times \n}\) (covariance matrix). 
</p>

<p>
Example: 
\[ \Sigma = \begin{pmatrix} a_1 & b_1 \\b_2 & a_2\end{pmatrix} \] 
These values change the form of the normal distribution. For example, if \(a_1 < a_2\), the distribution is squeezed (in dimension $x<sub>1</sub>), vice versa it is stretched. \(b_1, b_2\) model the correlations between \(x_1, x_2\). 
</p>

<p>
\[\mu = \begin{pmatrix} \mu_1 \\ \mu_2\end{pmatrix} \] shift the center of the distribution.
</p>

<p>
\[p(x;\mu,\Sigma) = ((2\i)^{n/2}|\Sigma|^{1/2})^{-1} \exp(-1/2 (x-\mu)^T\Sigma^{-1}(x-\mu))\]
</p>
</div>
</div>

<div id="outline-container-orgff885e8" class="outline-3">
<h3 id="orgff885e8"><span class="section-number-3">9.8.</span> Anomaly Detection using the Multivariate Gaussian Distribution</h3>
<div class="outline-text-3" id="text-9-8">
<p>
Fit model \(p(x)\) by
</p>

<p>
\[\mu = 1/m \sum^m_{i=1} x^{(i)} \]
\[\Sigma = 1/m \sum^m_{i=1}(x^{(i)}-\mu)(x^{(i)}-\mu)^T \]
</p>

<p>
Calculate \[p(x)\], flag anomaly if \(p(x) < \epsilon\)
</p>

<p>
You can prove that the original (non-multivariate) corresponds (up to identity!) to a special case of multivariate Gaussian distribution where the dist is axis-aligned, i.e. \(b_1,b_2\) are 0, i.e. \(\Sigma\) has 0 on off-diagonal entries. 
</p>

<p>
Original model is used somewhat more often. By adding features one can model dependencies between the features. Multivariate has this built in. But is computationally more expensive, doesn&rsquo;t scale well to large \(n\). In addition, multivariate needs more examples than features (mathematical necessity since \(\Sigma\) must be invertible).
</p>
</div>
</div>

<div id="outline-container-org37c95d6" class="outline-3">
<h3 id="org37c95d6"><span class="section-number-3">9.9.</span> Recommender Systems: Problem Formulation</h3>
<div class="outline-text-3" id="text-9-9">
<p>
Sometimes you need new features, and learn them first. Predicting movie ratings. 
\(n_u =\) number of users, \(n_m\) = number of movies, \(r(i,j) = 1\) if user \(j\) has rated movie \(i\), \(y^{(i,j)} =\) rating given by use \(j\) to movie \(i\).
</p>

<p>
Our job: fill in missing values.
</p>
</div>
</div>

<div id="outline-container-org242ac63" class="outline-3">
<h3 id="org242ac63"><span class="section-number-3">9.10.</span> Content Based Recommendations</h3>
<div class="outline-text-3" id="text-9-10">
<p>
Suppose you have two features per movie \(\in [0,1]\), e.g. romance and action.
One possibility: For each user \(j\), learn a parameter \(\theta^{(j)} \in \mathbb{R}^3\). Predict user \(j\) as rating movie \(i\) with \((\theta^{(j)})^T x^{(i)}\) stars.
</p>

<p>
To learn \(\theta^{(j)}\) is basically a linear regression problem. So minimize the squared error term with regularization. Do this e.g. by gradient descent.
</p>

<p>
This is basically just linear regression for all users on the features. Not extremely interesting. But what if you don&rsquo;t have features for the movies?
</p>
</div>
</div>

<div id="outline-container-org7fa42f4" class="outline-3">
<h3 id="org7fa42f4"><span class="section-number-3">9.11.</span> Collaborative Filtering</h3>
<div class="outline-text-3" id="text-9-11">
<p>
CF can learn for itself, what features to use. How? Suppose we have a dataset without the values for features. Suppose users told us how much they liked action packed movies, romantic movies etc. 
</p>

<p>
\[\theta^{(1)} = \begin{bmatrix}0\\0\end{bmatrix},\ \theta^{(2)} = \begin{bmatrix}0\\3\end{bmatrix},\ \theta^{(3)} = \begin{bmatrix}0\\5\end{bmatrix}\]
</p>

<p>
Given \(\theta^{(1)},\dots,\theta^{(n_u)}\), learn \(x^{(i)}\) by error minimization. Learn all the features for all the movies at once. 
</p>

<p>
So now, what to estimate? Apparently by starting randomly and then iteratively estimating theta via x and x via theta. Need to figure out why that works exactly.
</p>

<p>
Collaborative because users &rsquo;collaborate&rsquo; so everybody gets better recommendations.
</p>
</div>
</div>

<div id="outline-container-org49b0108" class="outline-3">
<h3 id="org49b0108"><span class="section-number-3">9.12.</span> Collaborative Filter Algorithm</h3>
<div class="outline-text-3" id="text-9-12">
<p>
Minimize \(x^{(i)},\dots,x^{(n_m)}\) and \(\theta^{(i)},\dots,\theta^{(n_u)}\) simultaneously.
</p>

<p>
Do away with the convention of the intercept term, so \(x \in \mathbb{R}^n\), since if there is need, the algorithm will learn it by itself.
</p>

<ol class="org-ol">
<li>Initialize parameters to small random values.</li>
<li>Minimize cost function using gradient descent (or similar).</li>
</ol>
</div>
</div>
<div id="outline-container-org60f067d" class="outline-3">
<h3 id="org60f067d"><span class="section-number-3">9.13.</span> Vectorization: Low Rank Matrix Factorization</h3>
<div class="outline-text-3" id="text-9-13">
<p>
Write all predicted ratings up in a matrix \(Y\). Further, you have \(X\) and \(\Theta\), such that \(Y = X\Theta^T\). This matrix is &rsquo;low rank&rsquo; in linear algebra. No explanation as to what that is (&ldquo;don&rsquo;t worry about it&rdquo;). 
</p>

<p>
\[X = \begin{bmatrix} - & (x^{(1)})^T & - \\ & \vdots & \\ - & (x^{(n_m)} & - \end{bmatrix},\ \Theta = \begin{bmatrix} - & (\theta^{(1)})^T & - \\ & \vdots & \\ - & (\theta^{(n_u)} & - \end{bmatrix}\]
</p>

<p>
\[Y = \displaystyle \begin{bmatrix} (x^{(1)})^T(\theta^{(1)}) & \ldots & (x^{(1)})^T(\theta^{(n_u)})\\ \vdots & \ddots & \vdots \\ (x^{(n_m)})^T(\theta^{(1)}) & \ldots & (x^{(n_m)})^T(\theta^{(n_u)})\end{bmatrix}\]
</p>

<p>
For each product \(i\), we learn a feature vector \(x^{(i)} \in \mathbb{R}^2\). Not always are the features easily human-understandable.
</p>

<p>
How to find movies \(j\) related to movie \(i\) ? Find the 5 movies j with the smalles distance \(||x^{(i)} - x^{(j)}||\).
</p>
</div>
</div>

<div id="outline-container-org4ca404a" class="outline-3">
<h3 id="org4ca404a"><span class="section-number-3">9.14.</span> Mean Normalization</h3>
<div class="outline-text-3" id="text-9-14">
<p>
Can make the algorithm a little bit better. If a user hasn&rsquo;t rated anything yet, the algorithm will set all \(\thetas\) to 0. But that isn&rsquo;t very useful right now. Change all the other values such that the average rating is 0. 
</p>

<p>
Then, predict for use \(j\) on movie \(i\):
\[\theta^{(j)}^T x^{(i)} + \mu_i\]
</p>
</div>
</div>
</div>


<div id="outline-container-orgcc4fc46" class="outline-2">
<h2 id="orgcc4fc46"><span class="section-number-2">10.</span> Week 10 large Scale Machine Learning</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org8019305" class="outline-3">
<h3 id="org8019305"><span class="section-number-3">10.1.</span> Learning with Large Datasets</h3>
<div class="outline-text-3" id="text-10-1">
<p>
&ldquo;It&rsquo;s not who has the best algorithms that wins, it&rsquo;s who has the most data&rdquo;
</p>

<p>
\(m = 100,000,000\) not unrealistic. Then gradient descent can become prohibitively expensive. Maybe pick randomly some examples as a sanity check. If high variance (\(J_{CV} >> J_{train}\)), then it is prudent to use more data. Methods: Stochastic Gradient Descent, Map Reduce.
</p>
</div>
</div>
