ml.org
** Stochastic Gradient Descent

Suppose linear regression model with gradient descent.

The derivative term can get quite large, so calculating the new derivative with all data points can be quite expensive. Called: Batch gradient descent. 

$$J_{train}(\theta) = \frac{1}{2m} \sum^m_{i=1}(h_\theta(x^{(i)}) - y^{(i)})^2$$

$$\theta_j := \theta_j - \alpha \frac{1}{m} \sum^m_{i=1} (h_\theta(x^{(i)})-y^{(i)})x^{(i)}_j$$

Instead:

$$cost(\theta, (\x^{(i)},y^{(i)})) = \frac{1}{2}(h_\theta(x^{(i)} - y^{(i)})^2$$ 

$$J_{train} (\theta) = \frac{1}{m} \sum_{i=1}^m cost(\theta, (\x^{(i)},y^{(i)}))$$

Algorithm: 
1.Randomly shuffle dataset
2. Repeat {
  for $i = 1,\dots,m$ {
  $$ \theta_j := \theta_j -\alpha (h_\theta(x^{(i)} - y^{(i)})x^{(i)}_j $$
    (for $j=0,\dots,n$)
  }
}
Where the part after $\alpha$ is the partial derivative $$\frac{\partial}{\partial \theta_j} cost(\theta,(x^{(i)},y^{(i)})$$.

While this is much faster, it usually doesn't converge. But hovers around a minimum. Up to 10 passes through the data set is common.

** Mini-Batch Gradient Descent

Use $b$ examples in each interation, $b$ is the mini-batch size $\e 2,\dots,100$. 

Go through all training examples in batches of $b$.
$$\theta_j := \theta_j - \alpha \frac{1}{b} \sum^{i+b-1}_{k=i} (h_\theta(x^{(k)})-y^{(k)})x^{(k)}_j$$

Mini-batch can outperform SGD if the code is properly vectorized.

** Stochastic Gradient Descent Convergence

How to check for convergence?
How to pick learning rate $\alpha$?

Check that the algorithm is converging don't calculate the cost function all the time. Inefficient! 

During learning, compute $cost(\theta,(x^{(i)},y^{(i)}))$ before updating $\theta$ on $(x^{(i)},y^{(i)})$. Every 1000 iterations or so, plot the cost functioned averaged over the last 1000 examples processed.

By using a smaller learning rate, you might be able to get a better result (lower cost). Sometimes, averaging over more than 1000 examples can better show trends in the cost function. If the cost function is increasing, use smaller $\alpha$!

Normally, $\alpha$ is constant, but it may help to slowly decrease $\alpha$ over time to help convergence.

** Online Learning

Model problems with continuous stream of data coming in. For example, users coming to the website provide new data repeatedly. 

Discard the notion of a training set. Update on one example at a time, then 'throw it away'. Useful if data is essentially free, i.e. almost too much to handle. 

This algorithm can adapt to changes of input data (e.g. in user's preferences).

Very similar to stochastic gradient descent algorithm.

** Map Reduce and Parallelism

Sometimes too much data for one machine. Some say map reduce is an even more important idea than gradient descend.

Suppose Batch gradient descent. $m=400$. Split training set into 4 subsets. Let machines 1...4 compute the gradient for these subsets, or multiple cores. 

Many learning algorithms can be expressed as computing sums of functions over the training set.

* Week 11 Application Example: Photo OCR

** Problem Description and Pipeline

Photo optical character recognition. Where is text in the image? Read text in image. 

Photo OCR pipeline

1) Text detection
2) Character segmentation
3) Character classification
4) Spelling correction (will skip here)

** Sliding Windows

1) Text Detection

Rectangular patches sliding over the image, checking whether it contains a pedestrian (e.g.). Use step-size/stride. Repeat for patches of different sizes, where the larger patches are rescaled such that the resolution is identical to the smaller patches.

Applied to the test set image, a sliding-windows-classifier reveals text as lots of sliding windows. Then apply an expansion algorithm, to connect the segmented windows with text. Then draw rectangles on very wide but low connected regions: These are recognized texts.

2) Character Segmentation

Train classifier on splits between characters. Then use sliding windows classifier to separate characters via splits. 

3) Character classification

This now is the standard character classification task

** Gettings Lots of Data and Artificial Data

Apparently one of the best ways to get a high performing system is to take low bias algorithm and loads of data. Where to get that data from? -> Artificial Data Synthesis. Creating new data from scratch, and extend existent data. For text data: Use computer fonts to generate images and get synthetic data. Alternatively, use existing labeled data and distort it in reasonable ways. Distortion should be meaningful (i.e. background noise etc.), adding random gaussian noise or similar usually doesn't help well.

Make sure to use a low bias classifier before expending the effort.

** Ceiling Analysis: What part of the Pipeline to work on next?

Have a single number evaluation metric for parts of the system. E.g. Accuracy. Ceiling Analysis intervenes and sets parts of the pipeline manually to 100% accuracy. Then see how the whole system behaves. This way, you see how much effect working on the different parts of the pipeline has on your overall accuracy.
