ml.html

<div id="outline-container-org6ac1b42" class="outline-3">
<h3 id="org6ac1b42"><span class="section-number-3">10.2.</span> Stochastic Gradient Descent</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Suppose linear regression model with gradient descent.
</p>

<p>
The derivative term can get quite large, so calculating the new derivative with all data points can be quite expensive. Called: Batch gradient descent. 
</p>

<p>
\[J_{train}(\theta) = \frac{1}{2m} \sum^m_{i=1}(h_\theta(x^{(i)}) - y^{(i)})^2\]
</p>

<p>
\[\theta_j := \theta_j - \alpha \frac{1}{m} \sum^m_{i=1} (h_\theta(x^{(i)})-y^{(i)})x^{(i)}_j\]
</p>

<p>
Instead:
</p>

<p>
\[cost(\theta, (\x^{(i)},y^{(i)})) = \frac{1}{2}(h_\theta(x^{(i)} - y^{(i)})^2\] 
</p>

<p>
\[J_{train} (\theta) = \frac{1}{m} \sum_{i=1}^m cost(\theta, (\x^{(i)},y^{(i)}))\]
</p>

<p>
Algorithm: 
1.Randomly shuffle dataset
</p>
<ol class="org-ol">
<li>Repeat {
for \(i = 1,\dots,m\) {
\[ \theta_j := \theta_j -\alpha (h_\theta(x^{(i)} - y^{(i)})x^{(i)}_j \]
  (for \(j=0,\dots,n\))
}</li>
</ol>
<p>
}
Where the part after \(\alpha\) is the partial derivative \[\frac{\partial}{\partial \theta_j} cost(\theta,(x^{(i)},y^{(i)})\].
</p>

<p>
While this is much faster, it usually doesn&rsquo;t converge. But hovers around a minimum. Up to 10 passes through the data set is common.
</p>
</div>
</div>

<div id="outline-container-org90fdd5c" class="outline-3">
<h3 id="org90fdd5c"><span class="section-number-3">10.3.</span> Mini-Batch Gradient Descent</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Use \(b\) examples in each interation, \(b\) is the mini-batch size \(\e 2,\dots,100\). 
</p>

<p>
Go through all training examples in batches of \(b\).
\[\theta_j := \theta_j - \alpha \frac{1}{b} \sum^{i+b-1}_{k=i} (h_\theta(x^{(k)})-y^{(k)})x^{(k)}_j\]
</p>

<p>
Mini-batch can outperform SGD if the code is properly vectorized.
</p>
</div>
</div>

<div id="outline-container-org307369a" class="outline-3">
<h3 id="org307369a"><span class="section-number-3">10.4.</span> Stochastic Gradient Descent Convergence</h3>
<div class="outline-text-3" id="text-10-4">
<p>
How to check for convergence?
How to pick learning rate \(\alpha\)?
</p>

<p>
Check that the algorithm is converging don&rsquo;t calculate the cost function all the time. Inefficient! 
</p>

<p>
During learning, compute \(cost(\theta,(x^{(i)},y^{(i)}))\) before updating \(\theta\) on \((x^{(i)},y^{(i)})\). Every 1000 iterations or so, plot the cost functioned averaged over the last 1000 examples processed.
</p>

<p>
By using a smaller learning rate, you might be able to get a better result (lower cost). Sometimes, averaging over more than 1000 examples can better show trends in the cost function. If the cost function is increasing, use smaller \(\alpha\)!
</p>

<p>
Normally, \(\alpha\) is constant, but it may help to slowly decrease \(\alpha\) over time to help convergence.
</p>
</div>
</div>

<div id="outline-container-orgb4ceda4" class="outline-3">
<h3 id="orgb4ceda4"><span class="section-number-3">10.5.</span> Online Learning</h3>
<div class="outline-text-3" id="text-10-5">
<p>
Model problems with continuous stream of data coming in. For example, users coming to the website provide new data repeatedly. 
</p>

<p>
Discard the notion of a training set. Update on one example at a time, then &rsquo;throw it away&rsquo;. Useful if data is essentially free, i.e. almost too much to handle. 
</p>

<p>
This algorithm can adapt to changes of input data (e.g. in user&rsquo;s preferences).
</p>

<p>
Very similar to stochastic gradient descent algorithm.
</p>
</div>
</div>

<div id="outline-container-org63afb79" class="outline-3">
<h3 id="org63afb79"><span class="section-number-3">10.6.</span> Map Reduce and Parallelism</h3>
<div class="outline-text-3" id="text-10-6">
<p>
Sometimes too much data for one machine. Some say map reduce is an even more important idea than gradient descend.
</p>

<p>
Suppose Batch gradient descent. \(m=400\). Split training set into 4 subsets. Let machines 1&#x2026;4 compute the gradient for these subsets, or multiple cores. 
</p>

<p>
Many learning algorithms can be expressed as computing sums of functions over the training set.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd530527" class="outline-2">
<h2 id="orgd530527"><span class="section-number-2">11.</span> Week 11 Application Example: Photo OCR</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgf4ce9ac" class="outline-3">
<h3 id="orgf4ce9ac"><span class="section-number-3">11.1.</span> Problem Description and Pipeline</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Photo optical character recognition. Where is text in the image? Read text in image. 
</p>

<p>
Photo OCR pipeline
</p>

<ol class="org-ol">
<li>Text detection</li>
<li>Character segmentation</li>
<li>Character classification</li>
<li>Spelling correction (will skip here)</li>
</ol>
</div>
</div>

<div id="outline-container-orgd22c0dd" class="outline-3">
<h3 id="orgd22c0dd"><span class="section-number-3">11.2.</span> Sliding Windows</h3>
<div class="outline-text-3" id="text-11-2">
<ol class="org-ol">
<li>Text Detection</li>
</ol>

<p>
Rectangular patches sliding over the image, checking whether it contains a pedestrian (e.g.). Use step-size/stride. Repeat for patches of different sizes, where the larger patches are rescaled such that the resolution is identical to the smaller patches.
</p>

<p>
Applied to the test set image, a sliding-windows-classifier reveals text as lots of sliding windows. Then apply an expansion algorithm, to connect the segmented windows with text. Then draw rectangles on very wide but low connected regions: These are recognized texts.
</p>

<ol class="org-ol">
<li>Character Segmentation</li>
</ol>

<p>
Train classifier on splits between characters. Then use sliding windows classifier to separate characters via splits. 
</p>

<ol class="org-ol">
<li>Character classification</li>
</ol>

<p>
This now is the standard character classification task
</p>
</div>
</div>

<div id="outline-container-org5568bb3" class="outline-3">
<h3 id="org5568bb3"><span class="section-number-3">11.3.</span> Gettings Lots of Data and Artificial Data</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Apparently one of the best ways to get a high performing system is to take low bias algorithm and loads of data. Where to get that data from? -&gt; Artificial Data Synthesis. Creating new data from scratch, and extend existent data. For text data: Use computer fonts to generate images and get synthetic data. Alternatively, use existing labeled data and distort it in reasonable ways. Distortion should be meaningful (i.e. background noise etc.), adding random gaussian noise or similar usually doesn&rsquo;t help well.
</p>

<p>
Make sure to use a low bias classifier before expending the effort.
</p>
</div>
</div>

<div id="outline-container-orgb19583a" class="outline-3">
<h3 id="orgb19583a"><span class="section-number-3">11.4.</span> Ceiling Analysis: What part of the Pipeline to work on next?</h3>
<div class="outline-text-3" id="text-11-4">
<p>
Have a single number evaluation metric for parts of the system. E.g. Accuracy. Ceiling Analysis intervenes and sets parts of the pipeline manually to 100% accuracy. Then see how the whole system behaves. This way, you see how much effect working on the different parts of the pipeline has on your overall accuracy.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: By Me</p>
<p class="date">Created: 2022-09-26 Mo 16:46</p>
</div>
</body>
</html>
